{
    "home": "Home",
    "product": "Product",
   "features": "Features",
    "security": "Security",
    "companies": "For Companies",
    "help": "Help",
    "donate": "Donate",
    "download": "Download",
    "language": "EN",
    "subscribe": "Social or Stay in touch",
    "contacts": "Contacts",
    "terms": "Terms of Use",
    "privacy&policy": "Privacy Policy",

    "button_learn_more": "Learn more", 

    "contact_us_page_title": "Contact us",
    "contact_us_page_country": "Ukraine",
    "contact_us_page_mail": "",
    "contact_us_page_socials": "Social networks",
    "contact_us_page_text": "If none of the options are suitable - just fill out the form and we will contact you",
    "contact_us_page_name": "Your name",
    "contact_us_page_number": "Phone number",
    "contact_us_page_users_email": "Email",
    "contact_us_page_comment": "Message text",
    "contact_us_page_send": "Send",

    "main_page_title": "Privacy in communication",
    "main_page_first_section_left_title": "Dober for individuals",
    "main_page_first_section_left_text": "Secure, anonymous, free of charge, without spam and adds, without collecting personal data - enjoy your freedom of communication",
    "main_page_first_section_right_title": "Dober for Companies",
    "main_page_first_section_right_text": "Independence, reliability, confidence, keeping of corporate secrets - use the privacy of corporate communication",
    "main_page_possibilities_title": "Main features",
    "main_page_possibilities_text": "Messenger for free minded. Confidentiality, anonymity, reliability - communicate freely without bias.",
    "main_page_possibilities_feature_1_title": "Privacy",
    "main_page_possibilities_feature_1_text": "This is not an additional marketing option, but the principle that we adhere to and based on which we work. Only trusted people have access to the server.",
    "main_page_possibilities_feature_2_title": "Security",
    "main_page_possibilities_feature_2_text": "You don't have to worry about communication history. We guarantee protection of your information in case of loss of your mobile device or other devices.",
    "main_page_possibilities_feature_3_title": "Availability",
    "main_page_possibilities_feature_3_text": "We are available on all platforms: IOS, Android, and Web. Gather people you know well in group chat.",
    "main_page_possibilities_feature_4_title": "Anonymity",
    "main_page_possibilities_feature_4_text": "Your account will not be linked to a mobile phone number or email address.",
    "main_page_possibilities_feature_5_title": "Functionality",
    "main_page_possibilities_feature_5_text": "Intuitive and pleasant interface. A familiar and efficient set of features, such as group and personal chats, file and document sharing.",
    "main_page_possibilities_feature_6_title": "Data Encryption",
    "main_page_possibilities_feature_6_text": "Multi-level encryption of calls and messages, which guarantees additional security.Trusted connection between servers. Secure push notifications that allow to display the message without a security risk and without transmitting metadata",

    "main_page_security_title": "Security",
    "main_page_security_text_par_1": "Your account is not linked to mobile phone number or email address and is completely anonymous. Your communication in the application is protected from unauthorized third-party access.", 
    "main_page_security_text_par_2": "We do not transfer users personal data to third-party companies or government agencies. The application does not store your personal data and encrypts your personal information, such as IP address or contacts list. We guarantee secure data storage.",
    "main_page_security_text_par_3": "Additional security features, such as notifying chat participants of a screenshot taken, which cannot be disabled.",

    "main_page_advantages_title": "Our benefits",
    "main_page_advantages_text_1": "End-to-end encryption enabled by default",
    "main_page_advantages_text_2": "No collection of personal data",
    "main_page_advantages_text_3": "Encrypting of personal identifiable information (IP address, contact list)",
    "main_page_advantages_text_4": "The use of strong cryptographic algorithms",
    "main_page_advantages_text_5": "User data storage",
    "main_page_advantages_text_6": "Protection of correspondence from access to it by the application administration",
    "main_page_advantages_text_7": "Access by PIN code or passphrase (no biometric access)",
    "main_page_advantages_text_8": "Protection of personal data from being transferred to state security agencies",
    "main_page_advantages_text_9": "Possibility of anonymous registration",
    "main_page_advantages_text_10": "Possibility to purge an account from the system",
    "main_page_advantages_text_11": "Notification of chat participants about the screenshot of the correspondence",
    "main_page_advantages_text_12": "Dedicated Server",

    "main_page_info_for_companies_title": "Information for corporate use",
    "main_page_info_for_companies_text": "A secure corporate messenger for communicating and interacting with your co-workers at any time, wherever you are. Dober corporate messenger is a turnkey solution, and only you control access to your internal information. Registration takes place without neither corporate email nor phone numbers, and only verified users will have access. This is a messenger without the risk of leaking corporate information or any important business documents",
    "main_page_info_for_companies_title_item_1": "Ease of communication",
    "main_page_info_for_companies_text_item_1": "Comfortable and fast communication with colleagues in a secure environment without distractions. Work anywhere and anytime from any device that suits you.",
    "main_page_info_for_companies_title_item_2": "Security",
    "main_page_info_for_companies_text_item_2": "Internal documents will no longer end up on employees' private phones or other private messengers unaccounted for. Dober is a messenger without the risk of leaking corporate information or other business documents. Full control over information and the platform, as all external and internal communication takes place through your server.",
    "main_page_info_for_companies_title_item_3": "Availability",
    "main_page_info_for_companies_text_item_3": "User-friendly and intuitive interface. Integration with the corporate address book. Save time and productivity by having all the important functions at your fingertips, including regular chats, group chats, file, and document sharing. Available on all platforms",
    "main_page_info_for_companies_title_item_4": "Isolated corporate server",
    "main_page_info_for_companies_text_item_4": "You use your own corporate server with an arbitrary location. A dedicated server that can work without connection to the outside world. Messenger administration does not have any access to your server, not even for notifications",
    "main_page_info_for_companies_title_item_5": "Privacy",
    "main_page_info_for_companies_text_item_5": "Your user account is not linked to biometric data or your contact information. No data about your location or online presence is collected or shared.",
    "main_page_info_for_companies_title_item_6": "Anonymity",
    "main_page_info_for_companies_text_item_6": "Support for the Tor anonymization protocol (an option that allows you to hide your IP address and protect your traffic from interception).",

    "features_page_top_section_title": "WHY Dober?",
    "features_page_top_section_text_1": "Confidentiality of correspondence and conversations is the right of every person in the world.",
    "features_page_top_section_text_2": "Use Dober - and privacy will be increased",
    "features_page_postulates_title": "Core Principles",
    "features_page_postulates_text": "Zero trust - the impossibility of disclosing unknown information about a non-existent personу",
    "features_page_postulates_title_item_1": "Security",
    "features_page_postulates_text_item_1": "Information is protected from unauthorized access, end-to-end encryption is implemented, secure data storage is guaranteed",
    "features_page_postulates_title_item_2": "Anonymity",
    "features_page_postulates_text_item_2": "There is no bond to a phone number or e-mail, the user's information is not collected or processed",
    "features_page_postulates_title_item_3": "Privacy",
    "features_page_postulates_text_item_3": "Information that is processed and stored in the system is available only to the sender and the recipient. Digital signature prevents impersonation",
    "features_page_postulates_title_item_4": "Independence",
    "features_page_postulates_text_item_4": "Own corporate server with random physical and network location and limited access is used",
    "features_page_principles_title": "Principle of work",
    "features_page_principles_text_1": "End-to-end encryption and the generation of encryption keys for each message make communication confidential and impossible to intercept.",
    "features_page_principles_text_2": "No account binding to phone numbers or e-mails allows you to communicate anonymously.Dedicated server (requires a license) allows you to avoid publicity as much as possible - unknown server address makes it non-existent.",
    "features_page_for_companies_title": "Suitable for such companies",
    "features_page_for_companies_text": "Processing and storage of corporate data, as well as clients personal information - the most vulnerable function and duty of every company. Dober helps keeping information in secret and increase the privacy of communication.",
    "features_page_for_companies_title_item_1": "Financial institutions",
    "features_page_for_companies_text_item_1": "Transfer banking secrets and financial information without the risk of leakage or interception",
    "features_page_for_companies_title_item_2": "Legal institutions",
    "features_page_for_companies_text_item_2": "With Dober, the exchange of agreements and documents becomes secure, and communication with clients becomes private",
    "features_page_for_companies_title_item_3": "Secret organizations",
    "features_page_for_companies_text_item_3": "Dober will not reveal your secrets because he does not know them",
    "features_page_for_companies_title_item_4": "Distributors",
    "features_page_for_companies_text_item_4": "Delivery time, prices and contracts are secure. No chance for business espionage",
    "features_page_for_companies_title_item_5": "Production",
    "features_page_for_companies_text_item_5": "Dober will protect design documentation, development discussions and production proccesses",
    "features_page_for_companies_title_item_6": "Public organizations",
    "features_page_for_companies_text_item_6": "Use Dober to exchange information - and privacy will be increased",

    "security_page_title": "FEATURES THAT GUARANTEE SECURITY",
    "security_page_text_item_1": "Asymmetric keys are used only for encryption of symmetric message keys and authentication process keys, which excludes the accumulation of statistics for hacking.",
    "security_page_text_item_2": "Each message is certified by authentication information - an electronic digital signature (EDS) of the author to the text of the message, which excludes the possibility of forgery",
    "security_page_text_item_3": "The system is built as a Zero-knowledge Service. ",
    "security_page_text_item_4": "Each new message is encrypted using a new 512-bit symmetric key obtained from the source of a cryptographically strong sequence of random numbers",
    "security_page_text_item_5": "Всі симетричні ключі мають розмір 512 біт.",
    "security_page_text_item_6_text_1": "Algorithms used in the encryption:",
    "security_page_text_item_6_text_2": "1. secp521r1",
    "security_page_text_item_6_text_3": "2. threefish512",
    "security_page_text_item_6_text_4": "3. ChaCha20-Poly1305 - SHA3-512",
    "security_page_text_item_7": "Techniques have been applied to ensure the maximum slowdown of a brute-force attack to protect against cracking the password of the main key pair.",
    "security_page_subtitle": "Open Source information ",
    "security_page_subtext_1": "To ensure transparency and increase trust in the application, we are working to make Dober an open-source product. Over time, relevant links will appear in this section.",
    "security_page_subtext_2": "Currently, we have confirmation from independent experts in field of information security regarding secure data transfer and information storage at Dober certificate.",
    "security_page_control_title": "Certificate of compliance and attestation Dober",

    "for_companies_page_title": "Secure communication platform",
    "for_companies_page_text_top_1": "Dober dedicated server is -",
    "for_companies_page_text_top_2": "your chosen location",
    "for_companies_page_text_top_3": "chosen and trusted users",
    "for_companies_page_text_top_4": "private server address",
    "for_companies_page_text_top_5": "the most secure information storage",
    "for_companies_page_subtitle_1": "For different types of companies",
    "for_companies_page_subtext_1": "Companies are different, the goal is the same - to protect corporate information",
    "for_companies_page_title_tab_1": "Financial institutions",
    "for_companies_page_text_1_tab_1": "Financial institutions process transactions, transfers and other financial transactions, that require special care and safety. Data protection helps prevent unauthorized access and manipulation with financial transactions, ensuring the reliability and integrity of financial processes",
    "for_companies_page_text_2_tab_1": "Dober allows you to exchange financial information, communicate with customers and employees, maintaining high standards of privacy, security and compliance with legal requirements.",
    "for_companies_page_title_tab_2": "Public organizations",
    "for_companies_page_text_1_tab_2": "Public organizations strive to maintain their reputation and the trust of their stakeholders. Leakage or unauthorized access to data can damage an organization's reputation and credibility. Data protection is an important aspect of public organizations work. ",
    "for_companies_page_text_2_tab_2": "Dober ensures privacy, data protection and secure communication, allowing organizations to effectively manage information, communications and their activities in general ",
    "for_companies_page_title_tab_3": "Secret organizations",
    "for_companies_page_text_1_tab_3": "Secret organizations must comply with laws and international standards regarding data protection and privacy information. This includes enforcing state secrets laws, controlling access to classified information and ensuring security when exchanging data with other agencies and partners. ",
    "for_companies_page_text_2_tab_3": "Dober safeguards government secrets, confidentiality of transactions, and protection of employees and agents because it does not know these secrets.",
    "for_companies_page_title_tab_4": "Legal institutions",
    "for_companies_page_text_1_tab_4": "Law firms are a target for cybercriminals who may try to gain access to sensitive data, hack email or steal sensitive information. Data protection helps prevent such threats and keep the company and its customers safe. ",
    "for_companies_page_text_2_tab_4": "Dober allows you to forget about email vulnerabilities and share sensitive data without the risk of leaking information to hackers or outsiders.",
    "for_companies_page_title_tab_5": "Distributors",
    "for_companies_page_text_1_tab_5": "Distributors depend on trust of their customers. Data protection helps prevent the leakage of customers' personal information, such as addresses, phone numbers, or payment card details. This maintains the reputation of the company and confirms its commitment to security and privacy. ",
    "for_companies_page_text_2_tab_5": "Dober ensures the confidentiality, integrity and reliability of information, and also protects commercial interests and reputation of the company.",
    "for_companies_page_title_tab_6": "Production",
    "for_companies_page_text_1_tab_6": "Manufacturers may have commercial information such as strategies, business plans, sales data and marketing research. Data protection keeps this information private, preventing it from being leaked or accessed by competitors or unauthorized persons. ",
    "for_companies_page_text_2_tab_6": "Dober ensures the confidentiality, integrity and availability of information, helping to prevent threats and ensure the reliability of operations and business development.",
    "for_companies_page_subtitle_2": "Security with dober",
    "for_companies_page_title_shield_1": "Centralized management",
    "for_companies_page_text_shield_1": "Centralized management of users and their devices. Providing access to information exchange and ontime blocking of individual users or compromised devices are the main steps on the way to information security in the messenger",
    "for_companies_page_title_shield_2": "Emergency reset of the application",
    "for_companies_page_text_shield_2": "Quick information zeroing on the client without loss of data in general in case of danger or compromise of the employee / device keeps confidentiality at maximum level and protects information from leakage",

    "use_dober_title": " Download and use Dober on your smartphone (IOS and Android), desktop (Web-application) or tablet",
    "use_dober_text": "Safe. Anonymous. Free of charge. No spam, no ads, and no personal data collection",

    "download_page_title": "Dober for your use",
    "download_page_item_1": "Download the Dober messenger mobile APPs and be sure of the privacy of your conversations",
    "download_page_item_2": "Use the web version of the Dober messenger without installing additional programs on the device",
    "download_page_item_3": "Download a specialized application for business and connect to your own or corporate server",

    "donate_page_title": "Donat For Dober",
    "donate_page_subtitle_1": "Donate cryptocurrency",
    "donate_page_subtitle_2": "Donate to Dober",
    "donate_page_subtitle_3": "Wallet Addresses",
    "donate_page_text_1": "Donations in cryptocurrency are accepted directly to the respective Dober wallets completely anonymously. If you want to support the project with a cryptocurrency that is not on the list, contact us via email address support@dober.chat ",
    "donate_page_text_2": "Your donations help us develop Dober, implement new security and anonymity features, and keep our servers running. They stimulate us to work and give us faith that we are on the right path.",

    "why_dober_title": "WHY Dober ?",
    "why_dober_text": "Because we believe in everyone's right to free communication and provide the opportunity to use it",

    "help_page_title": "How may we help you?",
    "help_page_question_1": "Why Dober is unique?",
    "help_page_answer_1": "You don’t need to provide any personal information (such as your phone number or email address) in order to use Dober. In Dober, all your communication is end-to-end encrypted –text messages, voice, video, files and group chats юDober supports TOR network connection out of the box, so that no one new your network location",
    "help_page_question_2": "What is Nickname in Dober?",
    "help_page_answer_2": "A unique Account code name , by which other Users can find your Account in the Messenger global search. The Nickname must consist of characters, signs and latin letters from 1 to 128, you cannot create a Nickname that consists only of characters/signs/digits. The use of \"underscores\" is allowed. The Nickname can't coincide with the login and can't include special characters and spaces. If you create a Nickname that is already used by another User, you won't be able to choose and create an identical one. If you need to change your Nickname, you can change it in “Account Settings”",
    "help_page_question_3": "Can Dober be used in corporate environment? ",
    "help_page_answer_3": "Dober was created for business needs and to work with dedicated servers. To work in a corporate environment, you must purchase a server license and use the Dober Business application",
    "help_page_question_4": "Can I use Dober without a SIM card?",
    "help_page_answer_4": "To use Dober, you absolutely do not need a phone number and a SIM card. Only Internet access required",
    "help_page_question_5": "Can I use Dober without email?",
    "help_page_answer_5": "There is absolutely no need for email to use Dober",
    "help_page_question_6": "Can I use Dober on multiple devices at the same time?",
    "help_page_answer_6": "Yes. Install the Dober application on several devices and enter the login and password from the same account",
    "help_page_question_7": "Why do I need a PIN when logging into my account?",
    "help_page_answer_7": "Pin code will be requested each time you sign in to Messenger as an additional way to protect against third party access to your Account and the data stored in it. Pin code is not connected to your face id and/or any other method of biometric identification. In case you do not want to enter the pin code every time you sign in to Messenger, you can save it by clicking \"save code\" in the pop-up window. Then the pin code will be saved and you will be able to enter Messenger without filling it every time",
    "help_page_question_8": "How and where does Dober store files?",
    "help_page_answer_8": "Dober stores the chat history on the server in encrypted form. Also, media content (video, photos, audio, files) is stored on the user's device in the form of crypto containers and is decrypted only when they are accessed through the Dober application.",
    "help_page_question_9": "Can I create \"Notes\" in Dober?",
    "help_page_answer_9": "Yes. For this, a special section \"My Notes\" has been created. The data in this section is stored on the server in encrypted form and is available only to the owner of the account. If there is media content in this section, then it is also stored on the phone in the form of crypto-containers and is decrypted only when accessed through the Dober application, when the user enters the \"My Notes\" section",
    "help_page_question_10": "Why is Dober safe for communication?",
    "help_page_answer_10_1": "The system is built as a Zero-knowledge Service with end-to-end encryption, ensuring that only you and the recipient can decrypt and read the information: all information on the server is encrypted by the client side, and even if an attacker physically takes possession of the server , he will be left with nothing, which was confirmed by a group of expert cryptanalysts who authorized access to a test server installation in order to test the resistance of our software to cryptographic attacks and tried to access information inside the built-in digital protection. In addition, everything related to correspondence between a group of users (two or more participants) will not be able to be seen by other users on the same server - a kind of isolation of groups and chats from other users and from hackers",
    "help_page_answer_10_2": "List of algorithms used in the encryption scheme: (secp521r1 / threefish512 / ChaCha20-Poly1305 / SHA3-512)",
    "help_page_answer_10_3": "End-to-end encryption mode is enabled by default. Moreover, no other mode is provided",
    "help_page_answer_10_4": "Techniques have been applied to ensure the maximum slowdown of a brute-force attack to protect against cracking the password of the main key pair; PBDKF variation ",
    "help_page_answer_10_5": "Asymmetric keys are used only for encryption of symmetric message keys and authentication process keys, which excludes the accumulation of statistics for hacking; ",
    "help_page_answer_10_6": "All symmetric keys have a size of 512 bits, despite what is considered - even 128 bits of a symmetric key provide sufficient security",
    "help_page_answer_10_7": "Each new message is encrypted using a new 512-bit symmetric key obtained from the source of a cryptographically strong sequence of random numbers; OpenSSL ",
    "help_page_answer_10_8": "Each message is certified by authentication information - an electronic digital signature (EDS) of the author to the text of the message, which excludes the possibility of forgery",
    "help_page_question_11": "How to compare Dober with other messengers?",
    "help_page_answer_11_1": "You can compare Dober with popular messengers at the",
    "help_page_answer_11_2": "link",
    "help_page_question_12": "Can you decrypt my messages?",
    "help_page_answer_12": "No, we can't. Dober servers do not store user passwords, nor do they store password hash functions. Only encryption keys encrypted with the user's password are stored. Therefore, only a person who knows the password can decrypt the keys for further use. Dober does not check the complexity of the password, but as the User enters the password, Dober may indicate the complexity of the password. Dober recommends creating a strong password and not using common words or character sets that are easy to guess or guess.",
    "help_page_question_13": "What is the minimum Android version supported?",
    "help_page_answer_13": "The minimum required Android version is 9",
    "help_page_question_14": "What permissions does the app need and why?",
    "help_page_answer_14_1": "The app requires the following permissions for all features to work:",
    "help_page_answer_14_2": "access to the camera - to record video messages and take photos ",
    "help_page_answer_14_3": "access to the phone's memory - to save media messages to the gallery and send files ",
    "help_page_answer_14_4": "access to the microphone - to record audio messages ",
    "help_page_answer_14_5": "access to notifications - to notify the user about a new message ",
    "help_page_answer_14_6": "network access - to access servers via the Internet",
    "help_page_question_15": "Will my data be deleted if I reinstall the app?",
    "help_page_answer_15": "When reinstalling the application, locally saved data will be deleted, but the history of correspondence on the server will remain available to the user after a new installation of the application and logging into the account with a login password",
    "help_page_question_16": "How to save media files?",
    "help_page_answer_16_1": "In a single or group chat, invoke the message menu and select the item - Download. Folders where Dober stores saved attachments:",
    "help_page_answer_16_2": "Downloads/Dober/Audio ",
    "help_page_answer_16_3": "Downloads/Dober/Files ",
    "help_page_answer_16_4": "Downloads/Dober/Pictures ",
    "help_page_answer_16_5": "Downloads/Dober/Video",
    "help_page_question_17": "Is it possible to save files and chat history to Google Drive or iCloud?",
    "help_page_answer_17": "Of course not, it's against security rules. Information is stored exclusively on Dober servers in encrypted form and on the user's smartphone in the form of crypto containers",
    "help_page_question_18": "Is there a synchronization with the phone book?",
    "help_page_answer_18": "No, this is against the rules of anonymity and may indirectly help determine the identity of users",
    "help_page_question_19": "What does the icon next to the group avatar mean?",
    "help_page_answer_19": "The icon symbolizes the group and indicates if any of the group members are online. If at least one member of the group is online, the icon turns green",
    "help_page_question_20": "Is it possible to permanently delete a message from Dober and how to do it?",
    "help_page_answer_20": "Yes, you can. To do this, go to a single or group chat, invoke the message menu and select the item - Delete. You can only delete your messages. This function deletes the message from the database and overwrites the cell with a random set of characters to prevent recovery of information by special programs."
}