{
    "home": "Home",
    "product": "Product",
   "features": "Features",
    "security": "Security",
    "companies": "For Companies",
    "help": "Help",
    "donate": "Donate",
    "download": "Download",
    "language": "EN",
    "subscribe": "Social or Stay in touch",
    "contacts": "Contacts",

    "button_learn_more": "Learn more", 

    "main_page_title": "A platform for all your secure internal and corporate communications. Privacy in communication.",
    "main_page_first_section_left_title": "Personal and family usage",
    "main_page_first_section_left_text": "If you value your safety and security – the Dober app is just for you. Safe. Anonymous. Free of charge. No spam, no ads, and no personal data collection.",
    "main_page_first_section_right_title": "Information for corporate use.",
    "main_page_first_section_right_text": "Dober provides encryption on multiple levels and guarantees secure connection to the servers. Additionally, push notifications do not disclose the contents of the message or any meta-data to the OS the app is running on, ensuring no data is leaked to a middleman. If you value security and anonymity above all else, Dober is a great solution for your business. Data leaks will not be a problem anymore.",

    "main_page_possibilities_title": "Our features",
    "main_page_possibilities_text": "Messenger for those who value their privacy. Communicate anonymously and safely without disclosing your personal information. No ads, no spam, no data collection.",
    "main_page_possibilities_feature_1_title": "Privacy",
    "main_page_possibilities_feature_1_text": "This is not an additional marketing option, but the principle that we adhere to and based on which we work. Only trusted people have access to the server.",
    "main_page_possibilities_feature_2_title": "Security.",
    "main_page_possibilities_feature_2_text": "You don't have to worry about communication history. We guarantee protection of your information in case of loss of your mobile device or other devices.",
    "main_page_possibilities_feature_3_title": "Availability.",
    "main_page_possibilities_feature_3_text": "We are available on all platforms: IOS, Android, and Web. Gather people you know well in group chat.",
    "main_page_possibilities_feature_4_title": "Anonymity.",
    "main_page_possibilities_feature_4_text": "Your account will not be linked to a mobile phone number or email address.",
    "main_page_possibilities_feature_5_title": "Functionality.",
    "main_page_possibilities_feature_5_text": "Intuitive and pleasant interface. A familiar and efficient set of features, such as group and personal chats, file and document sharing.",
    "main_page_possibilities_feature_6_title": "Data Encryption.",
    "main_page_possibilities_feature_6_text": "Multi-level encryption of calls and messages for added security. Trusted connection between servers. Secure push notifications that allow you to display the message without compromising security and without transmitting metadata.",

    "main_page_security_title": "Security or Secure",
    "main_page_security_text": "Your account is not linked to mobile phone number or email address and is completely anonymous. Your communication in the application is protected from unauthorized third-party access. We do not transfer users personal data to third-party companies or government agencies. The application does not store your personal data and encrypts your personal information, such as IP address or contacts list. We guarantee secure data storage. Additional security features, such as notifying chat participants of a screenshot taken, which cannot be disabled.", 

    "main_page_advantages_title": "Our benefits",
    "main_page_advantages_text_1": "End-to-end encryption enabled by default. No collection of personal data. Encrypting of personal identifiable information (IP address, contact list). The use of strong cryptographic algorithms. Persistance of user data. Protection of correspondence from access to it by the application administration. Access by PIN code or passphrase (no access using face recognition systems). Protection of personal data from being transferred to state security agencies. Possibility of anonymous registration. Possibility to purge an account from the system. Notification of chat participants about the screenshot of the correspondence. Dedicated Server",

    "main_page_info_for_companies_title": "Information for corporate use",
    "main_page_info_for_companies_text": "A secure corporate messenger for communicating and interacting with your co-workers at any time, wherever you are. Dober corporate messenger is a turnkey solution, and only you control access to your internal information. Registration takes place without neither corporate email nor phone numbers, and only verified users will have access. This is a messenger without the risk of leaking corporate information or any important business documents",
    "main_page_info_for_companies_title_item_1": "Get things done in one place",
    "main_page_info_for_companies_text_item_1": "Comfortable and fast communication with colleagues in a secure environment without distractions. Work anywhere and anytime from any device that suits you.",
    "main_page_info_for_companies_title_item_2": "Security",
    "main_page_info_for_companies_text_item_2": "Internal documents will no longer end up on employees' private phones or other private messengers unaccounted for. Dober is a messenger without the risk of leaking corporate information or other business documents. Full control over information and the platform, as all external and internal communication takes place through your server.",
    "main_page_info_for_companies_title_item_3": "Availability",
    "main_page_info_for_companies_text_item_3": "User-friendly and intuitive interface. Integration with the corporate address book. Save time and productivity by having all the important functions at your fingertips, including regular chats, group chats, file, and document sharing. Available on all platforms",
    "main_page_info_for_companies_title_item_4": "Isolated corporate server",
    "main_page_info_for_companies_text_item_4": "You use your own corporate server with an arbitrary location. A dedicated server that can work without connection to the outside world. Messenger administration does not have any access to your server, not even for notifications",
    "main_page_info_for_companies_title_item_5": "Privacy",
    "main_page_info_for_companies_text_item_5": "Your user account is not linked to biometric data or your contact information. No data about your location or online presence is collected or shared.",
    "main_page_info_for_companies_title_item_6": "Anonymity",
    "main_page_info_for_companies_text_item_6": "Support for the Tor anonymization protocol (an option that allows you to hide your IP address and protect your traffic from interception).",


    "use_dober_title": " Download and use Dober on your smartphone (IOS and Android), desktop (Web-application) or tablet",
    "use_dober_text": "Safe. Anonymous. Free of charge. No spam, no ads, and no personal data collection",

    "download_page_title": "Dober for your use"
}