{
    "home": "Home",
    "product": "Продукт",
   "features": "Возможности",
    "security": "Безопасность",
    "companies": "Для компаний",
    "help": "Помощь",
    "donate": "Donate",
    "download": "Скачать",
    "language": "RU",
    "subscribe": "Социальные сети",
    "contacts": "Контакты",

    "button_learn_more": "Подробнее", 

    "contact_us_page_title": "Связаться с нами",
    "contact_us_page_country": "Украина",
    "contact_us_page_mail": "",
    "contact_us_page_socials": "Социальные сети",
    "contact_us_page_text": "Если ни один из вариантов не подходит – просто заполните форму и мы свяжемся с вами",
    "contact_us_page_name": "Ваше имя",
    "contact_us_page_number": "Номер телефона",
    "contact_us_page_users_email": "Электронная почта",
    "contact_us_page_comment": "Текст сообщения",
    "contact_us_page_send": "Отправить",

    "main_page_title": "Приватность в общении",
    "main_page_first_section_left_title": "Dober для Пользователь",
    "main_page_first_section_left_text": "Безопасно. Анонимно. Бесплатно. Без спама, рекламы и без сбора персональных данных - пользуйтесь своей свободой общения",
    "main_page_first_section_right_title": "Dober для компаний",
    "main_page_first_section_right_text": "Hезависимость, надежность, доверие, хранение корпоративных тайн - пользуйтесь приватность корпоративного общения",
    "main_page_possibilities_title": "Наши возможности",
    "main_page_possibilities_text": "Мессенжер для тех, кто ценит свою конфиденциальность. Общайтесь анонимно и безопасно без разглашения вашей личной информации. Без рекламы, спама и сбора данных.",
    "main_page_possibilities_feature_1_title": "Конфиденциальность",
    "main_page_possibilities_feature_1_text": "Это не дополнительная маркетинговая опция, а принцип, которого мы придерживаемся и исходя из которого мы работаем. К серверу имеют доступ только доверенные лица",
    "main_page_possibilities_feature_2_title": "Безопасность.",
    "main_page_possibilities_feature_2_text": "Вам не нужно волноваться относительно истории общения. Мы гарантируем защиту вашей информации в случае потери мобильного устройства или других девайсов.",
    "main_page_possibilities_feature_3_title": "Мобильность.",
    "main_page_possibilities_feature_3_text": "Мы доступны на всех платформах: IOS, Android и Web. Собирайте хорошо вам знакомых людей в групповых чатах.",
    "main_page_possibilities_feature_4_title": "Анонимность.",
    "main_page_possibilities_feature_4_text": "Отсутствует привязка к мобильному номеру телефона или электронной почте.",
    "main_page_possibilities_feature_5_title": "Функциональность.",
    "main_page_possibilities_feature_5_text": "Интуитивно понятный и приятный интерфейс. Привычный и эффективный набор функций, таких как групповые и персональные чаты, обмен файлами и документами.",
    "main_page_possibilities_feature_6_title": "Шифрование.",
    "main_page_possibilities_feature_6_text": "Многоуровневое шифрование звонков и сообщений, что гарантирует дополнительную безопасность. Доверенное соединение между серверами. Безопасные push-сообщения, которые позволяют отображать текст сообщения без угрозы безопасности и без передачи метаданных.",
    "main_page_security_title": "Безопасность",
    "main_page_security_text_par_1": "Рабочие документы больше не будут попадать на частный телефон сотрудников или в другие частные мессенджеры без вашего ведома. Dober – это мессенджер без рисков утечки корпоративной информации или других бизнес документов. ", 
    "main_page_security_text_par_2": "Приложение не хранит ваши личные данные, а также шифрует вашу персональную информацию, такую как IP-адрес или список контактов. Мы гарантируем безопасное хранение данных.",
    "main_page_security_text_par_3": "Дополнительные функции, которые повышают уровень вашей безопасности. Например, оповещение участников чата о сделанном снимке экрана в переписке, которое нельзя отключить.",

    "main_page_advantages_title": "Наши преимущества",
    "main_page_advantages_text_1": "Использование сквозного шифрования по умолчанию",
    "main_page_advantages_text_2": "Отсутствие сбора личных данных пользователя",
    "main_page_advantages_text_3": "Шифрование персональной информации (IP-адрес, список контактов)",
    "main_page_advantages_text_4": "Применение надежных криптографических алгоритмов",
    "main_page_advantages_text_5": "Хранение данных пользователя",
    "main_page_advantages_text_6": "Защита переписки от доступа к ней администрации приложения",
    "main_page_advantages_text_7": "Доступ по PIN-коду или фразе-паролю (отсутствует доступ с помощью систем распознавания лиц)",
    "main_page_advantages_text_8": "Защита личных данных от передачи их государственным органам безопасности",
    "main_page_advantages_text_9": "Возможность анонимной регистрации",
    "main_page_advantages_text_10": "Возможность полного удаления учетной записи из системы",
    "main_page_advantages_text_11": "Оповещение участников чата о сделанном снимке экрана переписки",
    "main_page_advantages_text_12": "Выделенный сервер (отдельный физический сервер)",

    "main_page_info_for_companies_title": "Информация для корпоративного использования",
    "main_page_info_for_companies_text": "Защищенный корпоративный мессенджер для связи и взаимодействия с вашими коллегами в любое время, где бы вы ни находились. Корпоративный мессенджер Dober – это решение под ключ, только вы будете контролировать доступ к вашей внутренней информации. Регистрация происходит без корпоративной почты, без номеров телефонов, доступ будут иметь только проверенные пользователи. ",
    "main_page_info_for_companies_title_item_1": "Удобство в общении",
    "main_page_info_for_companies_text_item_1": "Комфортное и быстрое общение с коллегами в безопасной среде, где нет ничего лишнего. Работайте где угодно и когда угодно с любого удобного для вас устройства.",
    "main_page_info_for_companies_title_item_2": "Безопасность",
    "main_page_info_for_companies_text_item_2": "Рабочие документы больше не будут попадать на частный телефон сотрудников или в другие частные мессенджеры без вашего ведома. Dober – это мессенджер без рисков утечки корпоративной информации или других бизнес документов. .",
    "main_page_info_for_companies_title_item_3": "Мобильность",
    "main_page_info_for_companies_text_item_3": "Удобный и интуитивно понятный интерфейс. Интеграция с корпоративной адресной книгой. Сохранение времени и производительности, благодаря тому, что все важные функции в шаговой доступности, а именно: обычные чаты, групповые чаты, обмен файлами и документами. Доступен на всех платформах.",
    "main_page_info_for_companies_title_item_4": "Изолированный корпоративный сервер",
    "main_page_info_for_companies_text_item_4": "Используется ваш собственный корпоративный сервер с произвольным размещением. Выделенный сервер, который может работать без связи с внешним миром. Администрация мессенджера не имеет никаких доступов к вашему серверу, даже для оповещений",
    "main_page_info_for_companies_title_item_5": "Приватность",
    "main_page_info_for_companies_text_item_5": "Аккаунт пользователя не привязан к его биометрическим или контактным данным. Отсутствие сбора информации о вашем местонахождении или вашего присутствия в сети.",
    "main_page_info_for_companies_title_item_6": "Анонимность",
    "main_page_info_for_companies_text_item_6": "Поддержка протокола анонимизации Tor (опция, которая позволит скрыть IP-адрес и защитить ваш трафик от перехвата).",

    "use_dober_title": "Загружайте и используйте Dober на вашем смартфоне (IOS и Android), десктопе (через Web-приложение) или планшете",
    "use_dober_text": "Безопасно. Анонимно. Бесплатно. Без спама, рекламы и без сбора персональных данных",

    "download_page_title": "Dober для вашего использования",
    "download_page_item_1": "Загружайте мобильные версии мессенджера Dober и будьте уверены в конфиденциальности разговоров",
    "download_page_item_2": "Используйте веб-версию Dober мессенджера без установки дополнительных программ на устройстве",
    "download_page_item_3": "Загружайте специализированное приложение для бизнеса и подключайтесь к собственному или корпоративному серверу.",

    "donate_page_title": "Донать Для Dober",
    "donate_page_subtitle_1": "Donate CRYPTO",
    "donate_page_subtitle_2": "Donate Money",
    "donate_page_text_1": "Донаты в криптовалюте принимаются напрямую на соответствующие кошельки Dober абсолютно анонимно. Если вы хотите поддержать проект криптовалютой, которой нет в списке, напишите нам адрес support@dober.chat ",
    "donate_page_text_2": "Ваши пожертвования помогают нам развивать Dober, вводить новые функции безопасности и анонимности и поддерживать работу наших серверов. Они стимулируют нас работать и вселяют веру, что мы на правильном пути.",

    "features_page_top_section_title": "Почему Dober?",
    "features_page_top_section_text": "Конфиденциальность переписки и разговоров – право каждого человека в мире.Используйте Dober – и конфиденциальность повысится",
    "features_page_postulates_title": "Основные принципы",
    "features_page_postulates_text": "Нулевое доверие – невозможность открыть неизвестную информацию о несуществующем лице",
    "features_page_postulates_title_item_1": "Безопасность",
    "features_page_postulates_text_item_1": "Информация защищена от несанкционированного доступа, внедрено сквозное шифрование, гарантировано безопасное хранение данных",
    "features_page_postulates_title_item_2": "Анонимность",
    "features_page_postulates_text_item_2": "Отсутствие привязки к телефону или электронной почте, личная информация пользователя не собирается и не обрабатывается",
    "features_page_postulates_title_item_3": "Конфиденциальность",
    "features_page_postulates_text_item_3": "Информация, которая циркулирует и хранится в системе, доступна только отправителю и адресату. Цифровая подпись предотвращает подмену личности",
    "features_page_postulates_title_item_4": "Независимость",
    "features_page_postulates_text_item_4": "Используется собственный корпоративный сервер с произвольным физическим и сетевым размещением и ограниченным доступом",
    "features_page_principles_title": "ПРинцип роботы ",
    "features_page_principles_text_1": "Сквозное шифрование и генерация ключей шифрования для каждого сообщения делают общение конфиденциальным и недоступным для перехвата.",
    "features_page_principles_text_2": "Отсутствие привязки аккаунтов к номерам телефона или электронной почты позволяют общаться анонимно Выделенный сервер (при покупке лицензии) позволяет максимально избежать публичности – незнание адреса сервера делает его несуществующим.",
    "features_page_for_companies_title": "Подходить для таких компаний",
    "features_page_for_companies_text": "Обработка и хранение корпоративных данных, а также личной информации клиентов – самый уязвимый функционал и обязанность каждой компании. Dober поможет сохранить информацию в секрете и повысить конфиденциальность общения.",
    "features_page_for_companies_title_item_1": "Финансовые учреждения",
    "features_page_for_companies_text_item_1": "Передавайте банковские тайны и финансовую информацию без риска утечки или перехвата",
    "features_page_for_companies_title_item_2": "Юридические учреждения",
    "features_page_for_companies_text_item_2": "С Dober обмен сделками, документами становится безопасным, а общение с клиентами – частным",
    "features_page_for_companies_title_item_3": "Секретные организации",
    "features_page_for_companies_text_item_3": "Dober не выдаст ваши секреты так как сам их не знает",
    "features_page_for_companies_title_item_4": "Дистрибьюторы",
    "features_page_for_companies_text_item_4": "Сроки поставок, цены и договоры безопасности. Никакого шанса бизнес шпионажу",
    "features_page_for_companies_title_item_5": "Производства",
    "features_page_for_companies_text_item_5": "Dober защитит проектную документацию, обсуждение разработки и сопровождение производства",
    "features_page_for_companies_title_item_6": "Общественные организации",
    "features_page_for_companies_text_item_6": "Используйте Dober для передачи информации и конфиденциальность повысится",

    "security_page_title": "Функции, которые Гарантируют безопасность",
    "security_page_text_item_1": "Асимметричные ключи используются только для шифрования симметричных ключей сообщений и ключей процесса аутентификации, что исключает накапливание статистики для взлома",
    "security_page_text_item_2": "Каждое сообщение заверено аутентикационной информацией - электронной цифровой подписью (ЭЦП) автора к тексту сообщения, что исключает возможность подлога",
    "security_page_text_item_3": "Система построена как Zero-knowledge Service.",
    "security_page_text_item_4": "Каждое новое сообщение зашифровано с использованием нового симметричного 512-ти битного ключа, получаемого из источника криптографически стойкой последовательности случайных чисел",
    "security_page_text_item_5": "Все симметричные ключи имеют размер 512 бит",
    "security_page_text_item_6_text_1": "Список алгоритмов шифрования :",
    "security_page_text_item_6_text_2": "1. secp521r1",
    "security_page_text_item_6_text_3": "2. threefish512",
    "security_page_text_item_6_text_4": "3. ChaCha20-Poly1305 - SHA3-512",
    "security_page_text_item_7": "Применены техники обеспечения максимального замедления атаки перебора паролей для защиты от взлома пароля основной пары ключей ",
    "security_page_subtitle": "Открытый исходный код",
    "security_page_subtext_1": "Для обеспечения прозрачности и повышения доверия к приложению мы работаем над тем, чтобы сделать Dober – продуктом с открытым кодом. Со временем в этом разделе появятся соответствующие ссылки.",
    "security_page_subtext_2": "В настоящее время у нас есть подтверждение независимых экспертов по защите информации относительно безопасной передачи данных и хранения информации в Dober сертификат.",
    "security_page_control_title": "Сертификат соответствия и аттестации Dober",

    "for_companies_page_title": "Платформа защищеного общения",
    "for_companies_page_text_top_1": "Выделенный сервер Dober – это выбранное вами размещение; выбранные вами доверенные пользователи; частный адрес сервера;",
    "for_companies_page_text_top_2": "максимально защищенное хранение информации",
    "for_companies_page_subtitle_1": "Для разных типов компаний",
    "for_companies_page_subtext_1": "Компании разные, цель одна – защитить корпоративную информацию",
    "for_companies_page_title_tab_1": "Финансовые учереждения",
    "for_companies_page_text_1_tab_1": "Финансовые учреждения обрабатывают транзакции, переводы и другие финансовые операции, которые требуют особой осторожности и безопасности. Защита данных помогает предотвратить несанкционированныйдоступ и манипуляции с финансовыми операциями, обеспечивая надежность и целостность финансовых процессов.",
    "for_companies_page_text_2_tab_1": "Dober позволяет обмениваться финансовой информацией, проводить коммуникацию с клиентами и сотрудниками, соблюдая высокие стандарты конфиденциальности, безопасности и соблюдения законодательных требований.",
    "for_companies_page_title_tab_2": "Общественные огранизациии",
    "for_companies_page_text_1_tab_2": "Общественные организации стремятся сохранять свою репутацию и доверие заинтересованных сторон. Утечка или несанкционированный доступ к данным может нанести ущерб репутации и доверию к организации. Защита данных является важным аспектом работы общественных организаций.",
    "for_companies_page_text_2_tab_2": "Dober обеспечивает конфиденциальность, защиту данных и безопасную коммуникацию, позволяя организациям эффективно управлять информацией, связями и своей деятельностью в целом.",
    "for_companies_page_title_tab_3": "Секретные огранизациии",
    "for_companies_page_text_1_tab_3": "Секретные организации должны соблюдать законы и международные стандарты, касающиеся защиты данных и конфиденциальности информации. Это включает соблюдение законов о государственной тайне, контроль за доступом к секретной информации и обеспечение безопасности при обмене данными с другими агентствами и партнерами.",
    "for_companies_page_text_2_tab_3": "Dober обеспечивает сохранность государственных секретов, конфиденциальность операций и защиту сотрудников и агентов поскольку сам не знает этих секретов.",
    "for_companies_page_title_tab_4": "Юридические учреждения",
    "for_companies_page_text_1_tab_4": "Юридические компании являются целью для киберпреступников, которые могут попытаться получить доступ к конфиденциальным данным, взломать электронную почту или украсть чувствительную информацию. Защита данных помогает предотвратить такие угрозы и обеспечить безопасность компании и ее клиентов.",
    "for_companies_page_text_2_tab_4": "Dober позволяет забыть про уязвимости электронной почты и обмениваться конфиденциальными данными без риска утечки информации к хакерам или посторонним личностям.",
    "for_companies_page_title_tab_5": "Дистрибьюторы",
    "for_companies_page_text_1_tab_5": "Дистрибьюторы зависят от доверия своих клиентов. Защита данных помогает предотвратить утечку личной информации клиентов, такой как адреса, номера телефонов или данные платежных карт. Это поддерживает репутацию компании и подтверждает ее приверженность безопасности и конфиденциальности.",
    "for_companies_page_text_2_tab_5": "Dober обеспечивает конфиденциальность, целостность и надежность информации, а также защищает коммерческие интересы и репутацию компании.",
    "for_companies_page_title_tab_6": "Производства",
    "for_companies_page_text_1_tab_6": "Производители могут иметь коммерческую информацию, такую как стратегии, бизнес-планы, данные о продажахи маркетинговые исследования. Защита данных обеспечивает конфиденциальность этой информации, предотвращая ее утечку или доступ со стороны конкурентов или несанкционированных лиц.",
    "for_companies_page_text_2_tab_6": " Dober обеспечивает конфиденциальность, целостность и доступность информации, помогая предотвратить угрозы и обеспечить надежность операций и развитие бизнеса.",
    "for_companies_page_subtitle_2": "Безопасность с dober",
    "for_companies_page_title_shield_1": "Централизованное управление",
    "for_companies_page_text_shield_1": "Централизованное управление пользователями и их устройствами. Предоставление доступа к обмену информацией и своевременное блокирование отдельных пользователей или скомпрометированных устройств – основные шаги по информационной безопасности в мессенджере",
    "for_companies_page_title_shield_2": "Аварийный сброс приложения",
    "for_companies_page_text_shield_2": "Быстрое обнуление информации на клиенте без потери данных в целом при опасности или компрометации сотрудника / устройства способствует максимальной конфиденциальности и защищает информацию от утечки.",

    "why_dober_title": "Почему Dober ?",
    "why_dober_text": "Потому что мы верим в право каждого на свободное общение и даем возможность им воспользоваться.",

    "help_page_question_1": "Почему Dober уникален?",
    "help_page_answer_1": "Вам не нужно предоставлять какую-либо личную информацию (например, номер телефона или адрес электронной почты), чтобы использовать Dober. В Dober все ваше общение полностью зашифровано — текстовые сообщения, голос, видео, файлы и групповые чаты. Dober поддерживает сетевое подключение TOR из коробки, так что никто не узнает ваше сетевое местоположение ",
    "help_page_question_2": "Что такое Nickname(псевдоним) в Dober?",
    "help_page_answer_2": "Уникальное кодовое имя Учетной записи, по которому другие Пользователи могут найти вашу Учетную запись в глобальном поиске Мессенджера. Никнейм должен состоять из символов, знаков и латинских букв от 1 до 128, при этом нельзя создать никнейм, который будет состоять только из символов/знаков/цифр. Допустимо использование “нижнего подчеркивания”. Никнейм не может совпадать с логином, а также не может включать в себя спецсимволы и пробелы. Если вы создаете никнейм, который уже используется другим Пользователем, вы не сможете выбрать и создать идентичный никнейм. В случае, если вам необходимо изменить никнейм, вы можете изменить его в “Настройках Учетной записи”",
    "help_page_question_3": "Можно ли использовать Dober в корпоративной среде?",
    "help_page_answer_3": "Dober создавался для бизнес потребностей и для работы с выделенными серверами. Для работы в корпоративной среде необходимо приобрести серверную лицензию и использовать приложение Dober Business",
    "help_page_question_4": "Можно ли использовать Dober без SIM-карты?",
    "help_page_answer_4": "Для использования Dober абсолютно не нужен номер телефона и Sim-карта. Необходим только доступ в интернет",
    "help_page_question_5": "Можно ли использовать Dober без электронной почты?",
    "help_page_answer_5": "Для использования Dober абсолютно не нужна электронная почта",
    "help_page_question_6": "Можно ли использовать Dober на нескольких устройствах одновременно?",
    "help_page_answer_6": "Да. Установите на несколько устройств приложение Dober и введите логин и пароль от одного и того же аккаунта",
    "help_page_question_7": "Зачем нужен ПИН-код при входе в аккаунт?",
    "help_page_answer_7": "Пин код будет запрашиваться при каждом входе в Мессенджер как дополнительный способ защиты от доступа третьих лиц к вашей Учетной записи и данным, которые хранятся в ней. Пин код не привязан к face id и/или любому иному способу идентификации по биометрии. В случае, если вы не хотите вводить пин код при каждом входе в Мессенджер, вы можете сохранить его, нажав \"сохранить код\" во всплывающем окне (pop-up). После этого пин код будет сохранен и вход в Мессенджер будет осуществляться без необходимости ввода пин кода",
    "help_page_question_8": "Как и где Dober хранит файлы?",
    "help_page_answer_8": "Dober хранит историю переписки на сервере в зашифрованном виде. Так же медиа контент (видео, фото, аудио, файлы) хранится на устройстве пользователя в виде крипто контейнеров и расшифровывается только в момент обращения к ним через приложение Dober",
    "help_page_question_9": "Могу ли я создавать «Заметки» в Dober?",
    "help_page_answer_9": "Да. Для этого создан специальный раздел \"Мои Заметки\". Данные этого раздела храняться на сервере в зашифрованном виде и доступны только хозяину аккаунта. Если в этом разделе есть медиа контент то он также хранится и на телефоне в виде криптоконтейнеров и расшифровывается только при обращении к нему через приложение Dober, когда пользователь входит в раздел \"Мои Заметки\"",
    "help_page_question_10": "Почему Dober безопасен для общения?",
    "help_page_answer_10_1": "Система построена как Zero-knowledge Service со сквозным (end-to-end) шифрованием, гарантируя, что только вы и адресат сможете расшифровать и прочесть информацию: вся информация на сервере хранится в зашифрованном клиентской стороной виде, и если даже злоумышленник физически завладеет сервером, он останется ни с чем, что и было подтверждено группой экспертов-криптоаналитиков, санкционированно получивших доступ к тестовой серверной установке с целью проверить устойчивость нашего ПО к криптографическим атакам и попытавшись доступиться до информации внутри выстроенной цифровой защиты. Кроме того, всё, что касается переписки между группой пользователей (два и более участников), никак не смогут увидеть другие пользователи на этом же сервере - своего рода изоляция групп и чатов от других пользователей и от взломщиков;",
    "help_page_answer_10_2": "Список алгоритмов, использованных в схеме шифрования: (secp521r1 / threefish512 / ChaCha20-Poly1305 / SHA3-512)",
    "help_page_answer_10_3": "Режим сквозного шифрования включен по умолчанию. Более того, никакой другой режим не предусмотрен;",
    "help_page_answer_10_4": "Применены техники обеспечения максимального замедления атаки перебора паролей для защиты от взлома пароля основной пары ключей; PBDKF вариация",
    "help_page_answer_10_5": "Асимметричные ключи имеют максимальный возможный размер;",
    "help_page_answer_10_6": "Асимметричные ключи используются только для шифрования симметричных ключей сообщений и ключей процесса аутентификации, что исключает накапливание статистики для взлома;",
    "help_page_answer_10_7": "Все симметричные ключи имеют размер 512 бит, при том, что считается - даже 128 бит симметричного ключа обеспечивают достаточную безопасность;",
    "help_page_answer_10_8": "Каждое новое сообщение зашифровано с использованием нового симметричного 512-ти битного ключа, получаемого из источника криптографически стойкой последовательности случайных чисел; OpenSSL",
    "help_page_answer_10_9": "Каждое сообщение заверено аутентикационной информацией - электронной цифровой подписью (ЭЦП) автора к тексту сообщения, что исключает возможность подлога;",
    "help_page_question_11": "Как сравнить Dober с другими мессенджерами?",
    "help_page_answer_11": "Сравнить Dober с популярными мессенджерами можно по ссылке __________",
    "help_page_question_12": "Вы можете расшифровать мои сообщения?",
    "help_page_answer_12": "Нет, не можем. На серверах Dober не сохраняются пароли пользователей, а также не сохраняются хэш функции паролей. Сохраняются только ключи шифрования зашифрованные пользовательским паролем. Поэтому расшифровать ключи для дальнейшего использования может только человек, знающий пароль. Dober не проверяет уровень сложности пароля, но по мере ввода Пользователем пароля Dober может указывать уровень его сложности. Dober рекомендует создавать надежный пароль и не использовать в качестве пароля распространенные слова или наборы символов, которые легко угадать или воспроизвести методом подбора.",
    "help_page_question_13": "Какая минимальная версия Android поддерживается?",
    "help_page_answer_13": "Минимально необходимая версия Android - 9",
    "help_page_question_14": "Какие разрешения требуются приложению и для чего?",
    "help_page_answer_14_1": "Для работы всех функций приложению необходимы следующие разрешения:",
    "help_page_answer_14_2": "доступ к камере – для записи видео сообщений и сьемки фото",
    "help_page_answer_14_3": "доступ к памяти телефона – для сохранения медиа сообщений в галерею и пересылки файлов",
    "help_page_answer_14_4": "доступ к микрофону – для записи аудио сообщений",
    "help_page_answer_14_5": "доступ к уведомлениям – для уведомления пользователя о новом сообщении",
    "help_page_answer_14_6": "доступ к сети – для доступа к серверам через Интернет",
    "help_page_question_15": "Удалятся ли мои данные если я переустановлю приложение?",
    "help_page_answer_15": "При переустановке приложения удалятся локально сохраненные данные, но история переписки на сервере останется и после новой установки приложения и входа в аккаунт с логином паролем будет доступна пользователю",
    "help_page_question_16": "Как сохранить медиа файлы?",
    "help_page_answer_16_1": "В одиночном или групповом чате вызвать меню сообщения и выбрать пункт - Скачать. Папки в которых Dober хранит сохраненные вложения:",
    "help_page_answer_16_2": "Downloads/Dober/Audio ",
    "help_page_answer_16_3": "Downloads/Dober/Files ",
    "help_page_answer_16_4": "Downloads/Dober/Pictures ",
    "help_page_answer_16_5": "Downloads/Dober/Video",
    "help_page_question_17": "Есть ли возможность сохранить файлы и историю переписки на Google Drive или iCloud?",
    "help_page_answer_17": "Конечно нет, это противоречит правилам безопасности. Информация хранится исключительно на серверах Dober в зашифрованном виде и на смартфоне пользователя в виде крипто контейнеров",
    "help_page_question_18": "Есть ли синхронизация с телефонной книгой?",
    "help_page_answer_18": "Нет, это противоречит правилам анонимности и может косвенно помочь определить личность пользователей",
    "help_page_question_19": "Что означает иконка возле аватарки группы?",
    "help_page_answer_19": "Иконка символизирует группу и подсказывает есть ли кто то из учасников группы онлайн. Если хоть один учасник группы онлайн – иконка становится зеленой",
    "help_page_question_20": "Возможно ли окончательно удалить сообщение из Dober и как это сделать?",
    "help_page_answer_20": "Да, можно. Для этого необходимо зайти в одиночный или групповой чат, вызвать меню сообщения и выбрать пункт – Удалить. Удалить можно только свои сообщения.Эта функция удаляет сообщение из базы данных и перезаписывает ячейку случайным набором символов, что бы недопустить восстановление информации специальными программами."
}