{
    "home": "Home",
    "product": "Продукт",
   "features": "Для компаний",
    "security": "Security",
    "companies": "Для компаний",
    "help": "Помощь",
    "donate": "Donate",
    "download": "Скачать",
    "language": "RU",
    "subscribe": "Социальные сети",

    "button_learn_more": "Подробнее", 

    "main_page_title": "Платформа для ваших безопасных внутренних и корпоративных коммуникаций.  Приватность в общении.",
    "main_page_first_section_left_title": "Персональное и семейное использование",
    "main_page_first_section_left_text": "Если вы цените вашу безопасность и защищенность — приложение Dober именно для вас. Безопасно. Анонимно. Бесплатно. Без спама, рекламы и без сбора персональных данных.",
    "main_page_first_section_right_title": "Информация для корпоративного использования.",
    "main_page_first_section_right_text": "Dober обеспечивает многоуровневое шифрование и доверенное соединение с серверами. Безопасные push-уведомления гарантируют получение оповещений без разглашения контента сообщений или метаданных операционной системе. Поэтому, если вы цените безопасность и анонимность, Dober – это отличное решение для вашего бизнеса. Контроль утечки корпоративной информации больше не будет проблемой.",

    "main_page_possibilities_title": "Наши возможности",
    "main_page_possibilities_text": "Мессенжер для тех, кто ценит свою конфиденциальность. Общайтесь анонимно и безопасно без разглашения вашей личной информации. Без рекламы, спама и сбора данных.",
    "main_page_possibilities_feature_1_title": "Конфиденциальность",
    "main_page_possibilities_feature_1_text": "Это не дополнительная маркетинговая опция, а принцип, которого мы придерживаемся и исходя из которого мы работаем. К серверу имеют доступ только доверенные лица",
    "main_page_possibilities_feature_2_title": "Безопасность.",
    "main_page_possibilities_feature_2_text": "Вам не нужно волноваться относительно истории общения. Мы гарантируем защиту вашей информации в случае потери мобильного устройства или других девайсов.",
    "main_page_possibilities_feature_3_title": "Мобильность.",
    "main_page_possibilities_feature_3_text": "Мы доступны на всех платформах: IOS, Android и Web. Собирайте хорошо вам знакомых людей в групповых чатах.",
    "main_page_possibilities_feature_4_title": "Анонимность.",
    "main_page_possibilities_feature_4_text": "Отсутствует привязка к мобильному номеру телефона или электронной почте.",
    "main_page_possibilities_feature_5_title": "Функциональность.",
    "main_page_possibilities_feature_5_text": "Интуитивно понятный и приятный интерфейс. Привычный и эффективный набор функций, таких как групповые и персональные чаты, обмен файлами и документами.",
    "main_page_possibilities_feature_6_title": "Шифрование.",
    "main_page_possibilities_feature_6_text": "Многоуровневое шифрование звонков и сообщений, что гарантирует дополнительную безопасность. Доверенное соединение между серверами. Безопасные push-сообщения, которые позволяют отображать текст сообщения без угрозы безопасности и без передачи метаданных.",

    "main_page_security_title": "Безопасность",
    "main_page_security_text": "Ваш аккаунт в Dober не привязывается к номеру телефона или к электронной почте, гарантируя анонимность. Ваше общение в приложении защищено от постороннего несанкционированного доступа. Мы не передаем личные данные пользователей сторонним компаниям или государственным органам. Приложение не хранит ваши личные данные, а также шифрует вашу персональную информацию, такую как IP-адрес или список контактов. Мы гарантируем безопасное хранение данных. Дополнительные функции, которые повышают уровень вашей безопасности. Например, оповещение участников чата о сделанном снимке экрана в переписке, которое нельзя отключить.", 

    "main_page_advantages_title": "Наши преимущества",
    "main_page_advantages_text_1": "Использование сквозного шифрования по умолчанию. Отсутствие сбора личных данных пользователя. Шифрование персональной информации (IP-адрес, список контактов). Применение надежных криптографических алгоритмов. Хранение данных пользователя. Защита переписки от доступа к ней администрации приложения. Доступ по PIN-коду или фразе-паролю (отсутствует доступ с помощью систем распознавания лиц). Защита личных данных от передачи их государственным органам безопасности. Возможность анонимной регистрации. Возможность полного удаления учетной записи из системы. Оповещение участников чата о сделанном снимке экрана переписки. Выделенный сервер (отдельный физический сервер)",

    "main_page_info_for_companies_title": "Информация для корпоративного использования",
    "main_page_info_for_companies_text": "Защищенный корпоративный мессенджер для связи и взаимодействия с вашими коллегами в любое время, где бы вы ни находились. Корпоративный мессенджер Dober – это решение под ключ, только вы будете контролировать доступ к вашей внутренней информации. Регистрация происходит без корпоративной почты, без номеров телефонов, доступ будут иметь только проверенные пользователи. Это мессенджер без риска утечки корпоративной информации или любых важных бизнес документов.",
    "main_page_info_for_companies_title_item_1": "Удобство в общении или Выполняйте все дела в одном месте",
    "main_page_info_for_companies_text_item_1": "Комфортное и быстрое общение с коллегами в безопасной среде, где нет ничего лишнего. Работайте где угодно и когда угодно с любого удобного для вас устройства.",
    "main_page_info_for_companies_title_item_2": "Безопасность",
    "main_page_info_for_companies_text_item_2": "Рабочие документы больше не будут попадать на частный телефон сотрудников или в другие частные мессенджеры без вашего ведома. Dober – это мессенджер без рисков утечки корпоративной информации или других бизнес документов. Полный контроль над информацией и платформой, ведь вся внешняя и внутренняя коммуникация происходит через ваш сервер.",
    "main_page_info_for_companies_title_item_3": "Мобильность",
    "main_page_info_for_companies_text_item_3": "Удобный и интуитивно понятный интерфейс. Интеграция с корпоративной адресной книгой. Сохранение времени и производительности, благодаря тому, что все важные функции в шаговой доступности, а именно: обычные чаты, групповые чаты, обмен файлами и документами. Доступен на всех платформах.",
    "main_page_info_for_companies_title_item_4": "Изолированный корпоративный сервер",
    "main_page_info_for_companies_text_item_4": "Используется ваш собственный корпоративный сервер с произвольным размещением. Выделенный сервер, который может работать без связи с внешним миром. Администрация мессенджера не имеет никаких доступов к вашему серверу, даже для оповещений",
    "main_page_info_for_companies_title_item_5": "Приватность",
    "main_page_info_for_companies_text_item_5": "Аккаунт пользователя не привязан к его биометрическим или контактным данным. Отсутствие сбора информации о вашем местонахождении или вашего присутствия в сети.",
    "main_page_info_for_companies_title_item_6": "Анонимность",
    "main_page_info_for_companies_text_item_6": "Поддержка протокола анонимизации Tor (опция, которая позволит скрыть IP-адрес и защитить ваш трафик от перехвата).",

    "use_dober_title": "Загружайте и используйте Dober на вашем смартфоне (IOS и Android), десктопе (через Web-приложение) или планшете",
    "use_dober_text": "Безопасно. Анонимно. Бесплатно. Без спама, рекламы и без сбора персональных данных",

    "down_load_title": "Dober для вашего использования"
}