{
    "home": "Home",
    "product": "Продукт",
   "features": "Для компаний",
    "security": "Security",
    "companies": "Для компаний",
    "help": "Помощь",
    "donate": "Donate",
    "download": "Скачать",
    "language": "RU",
    "subscribe": "Подписывайтесь на новости",

    "button_learn_more": "Подробнее.", 

    "main_page_title": "Платформа для ваших безопасных внутренних и корпоративных коммуникаций.  Приватность в общении.",
    "main_page_first_section_left_title": "Персональное и семейное использование",
    "main_page_first_section_left_text": "Если вы цените вашу безопасность и защищенность — приложение Dober именно для вас. Безопасно. Анонимно. Бесплатно. Без спама, рекламы и без сбора персональных данных.",
    "main_page_first_section_right_title": "Информация для корпоративного использования.",
    "main_page_first_section_right_text": "Dober обеспечивает многоуровневое шифрование и доверенное соединение с серверами. Безопасные push-уведомления гарантируют получение оповещений без разглашения контента сообщений или метаданных операционной системе. Поэтому, если вы цените безопасность и анонимность, Dober – это отличное решение для вашего бизнеса. Контроль утечки корпоративной информации больше не будет проблемой.",

    "main_page_possibilities_title": "Наши возможности",
    "main_page_possibilities_text": "Мессенжер для тех, кто ценит свою конфиденциальность. Общайтесь анонимно и безопасно без разглашения вашей личной информации. Без рекламы, спама и сбора данных.",
    "main_page_possibilities_feature_1_title": "Конфиденциальность",
    "main_page_possibilities_feature_1_text": "Это не дополнительная маркетинговая опция, а принцип, которого мы придерживаемся и исходя из которого мы работаем. К серверу имеют доступ только доверенные лица",
    "main_page_possibilities_feature_2_title": "Безопасность.",
    "main_page_possibilities_feature_2_text": "Вам не нужно волноваться относительно истории общения. Мы гарантируем защиту вашей информации в случае потери мобильного устройства или других девайсов.",
    "main_page_possibilities_feature_3_title": "Мобильность.",
    "main_page_possibilities_feature_3_text": "Мы доступны на всех платформах: IOS, Android и Web. Собирайте хорошо вам знакомых людей в групповых чатах.",
    "main_page_possibilities_feature_4_title": "Анонимность.",
    "main_page_possibilities_feature_4_text": "Отсутствует привязка к мобильному номеру телефона или электронной почте.",
    "main_page_possibilities_feature_5_title": "Функциональность.",
    "main_page_possibilities_feature_5_text": "Интуитивно понятный и приятный интерфейс. Привычный и эффективный набор функций, таких как групповые и персональные чаты, обмен файлами и документами.",
    "main_page_possibilities_feature_6_title": "Шифрование.",
    "main_page_possibilities_feature_6_text": "Многоуровневое шифрование звонков и сообщений, что гарантирует дополнительную безопасность. Доверенное соединение между серверами. Безопасные push-сообщения, которые позволяют отображать текст сообщения без угрозы безопасности и без передачи метаданных.",

    "down_load_title": "Dober для вашего использования"
}