{
    "home": "Головна",
    "product": "Продукт",
    "features": "Можливості",
    "security": "Безпека",
    "companies": "Для компаній",
    "help": "Довідка",
    "donate": "Пожертвувати",
    "download": "Завантажити",
    "language": "UA",
    "subscribe": "Соціальні мережі",
    "contacts": "Контакти",

    "button_learn_more": "Дізнайтесь більше", 

    "main_page_title": "Платформа для всіх ваших захищених внутрішніх і корпоративних комунікацій. Конфіденційність у комунікації.",
    "main_page_first_section_left_title": "Для особистого та сімейного використання.",
    "main_page_first_section_left_text": "Якщо ви цінуєте вашу безпеку та захищеність — додаток Dober саме для вас. Безпечно. Анонімно. Безкоштовно. Без спаму, реклами та без збору персональних даних",
    "main_page_first_section_right_title": "Інформація для корпоративного використання",
    "main_page_first_section_right_text": "Dober забезпечує багаторівневе шифрування та довірене зʼєднання з серверами. Безпечні push-повідомлення гарантують отримання сповіщень без розголошення контенту повідомлень чи метаданих операційній системі. Тож, якщо ви цінуєте безпеку та анонімність, Dober – це чудове рішення для вашого бізнесу. Контроль витоку корпоративної інформації більше не буде проблемою.",

    "main_page_possibilities_title": "Наші можливості",
    "main_page_possibilities_text": "Месенджер для тих, хто цінує свою приватність. Спілкуйтесь анонімно та безпечно без розголошення вашої приватної інформації. Без реклами, спаму та збору даних.",
    "main_page_possibilities_feature_1_title": "Конфіденційність.",
    "main_page_possibilities_feature_1_text": "Це не додаткова маркетингова опція, а принцип, який ми сповідуємо та за яким працюємо. До сервера мають доступ лише довірені особи",
    "main_page_possibilities_feature_2_title": "Безпека.",
    "main_page_possibilities_feature_2_text": "Вам не потрібно хвилюватись стосовно історії спілкування. Ми гарантуємо захист вашої інформації в разі втрати мобільного пристрою чи інших девайсів.",
    "main_page_possibilities_feature_3_title": "Мобільність.",
    "main_page_possibilities_feature_3_text": "Ми доступні на усіх платформах: IOS, Android та Web. Збирайте своїх добре вам знайомих людей у групових чатах.",
    "main_page_possibilities_feature_4_title": "Анонімність.",
    "main_page_possibilities_feature_4_text": "Відсутня привʼязка до мобільного номеру телефону чи електронної пошти.",
    "main_page_possibilities_feature_5_title": "Функціональність.",
    "main_page_possibilities_feature_5_text": "Інтуїтивно зрозумілий та приємний інтерфейс. Звичний та ефективний набір функцій, таких як групові чати та персональні чати, обмін файлами та документами.",
    "main_page_possibilities_feature_6_title": "Шифрування.",
    "main_page_possibilities_feature_6_text": "Багаторівневе шифрування дзвінків та повідомлень, що гарантує додаткову безпеку. Довірене зʼєднання між серверами. Безпечні push-повідомлення, які дозволяють відображати текст повідомлення без загрози безпеці та без передачі метаданих.",

    "main_page_security_title": "Безпека",
    "main_page_security_text": "Ваш аккаунт у Dober не привʼязується до номеру телефону чи електронної пошти, гарантуючи анонімність. Ваше спілкування у застосунку захищене від стороннього несанкціонованого доступу. Ми не передаємо особисті дані користувачів стороннім компаніям чи державним органам. Застосунок не зберігає ваші особисті дані, а також шифрує вашу персональну інформацію, таку як IP-адреса чи список контактів. Ми гарантуємо безпечне зберігання даних. Додаткові функції, які підвищують рівень вашої безпеки, як то сповіщення учасників чату про зроблений знімок екрана у листуванні, яку неможливо вимкнути.", 

    "main_page_advantages_title": "Наші переваги",
    "main_page_advantages_text_1": "Використання наскрізного шифрування за замовчуванням. Відсутність збору особистих даних користувача. Шифрування персональної інформації (IP-адреса, список контактів). Застосування надійних криптографічних алгоритмів. Зберігання даних користувача. Захист листування від доступу до нього адміністрації додатка.Доступ за PIN-кодом або фразою-паролем (відсутній доступ за допомогою систем розпізнавання облич). Захист особистих даних від передачі їх державним органам безпеки. Можливість анонімної реєстрації. Можливість повного видалення облікового запису з системи. Сповіщення учасників чату про зроблений знімок екрана листування. Виділений сервер (окремий фізичний сервер)",

    "main_page_info_for_companies_title": "нформація для корпоративного використання",
    "main_page_info_for_companies_text": "Захищений корпоративний месенджер для звʼязку та взаємодії з вашими колегами в будь-який час, де б ви не знаходились. Корпоративний месенджер Dober – це рішення під ключ, тільки ви будете контролювати доступ до вашої внутрішньої інформації. Реєстрація відбувається без корпоративної пошти, без номерів телефонів, доступ матимуть лише перевірені користувачі. Це месенджер без ризику витоку корпоративної інформації чи будь-яких важливих бізнес документів.",
    "main_page_info_for_companies_title_item_1": "Зручність або Робіть все в одному місц",
    "main_page_info_for_companies_text_item_1": "Комфортне та швидке спілкування з колегами в безпечному середовищі, де немає нічого зайвого. Працюйте де завгодно і коли завгодно з будь-якого зручного для вас пристрою",
    "main_page_info_for_companies_title_item_2": "Безпека",
    "main_page_info_for_companies_text_item_2": "Робочі документи більше не будуть потрапляти на приватний телефон співробітників чи в інші приватні месенджери без вашого відома. Dober – це месенджер без ризиків витоку корпоративної інформації чи інших бізнес документів. Повний контроль над інформацією та платформою, адже вся зовнішня та внутрішня комунікація відбувається через ваш сервер",
    "main_page_info_for_companies_title_item_3": "Мобільність",
    "main_page_info_for_companies_text_item_3": "Зручний та інтуїтивно зрозумілий інтерфейс. Інтеграція з корпоративною адресною книгою. Збереження часу та продуктивності, завдяки тому, що всі важливі функції будуть поруч, а саме: звичайні чати, групові чати, обмін файлами та документами. Доступний на усіх платформах",
    "main_page_info_for_companies_title_item_4": "Ізольований корпоративний сервер",
    "main_page_info_for_companies_text_item_4": "Використовується ваш власний корпоративний сервер з довільним розміщенням. Виділений сервер, який може працювати без звʼязку з зовнішнім світом. Адміністрація месенджера не має жодних доступів до вашого сервера, навіть для сповіщень",
    "main_page_info_for_companies_title_item_5": "Приватність",
    "main_page_info_for_companies_text_item_5": "Аккаунт користувача не прив’язаний до його біометричних чи контактних даних. Відсутність збору інформації про ваше місцезнаходження чи вашу присутності в мережі.",
    "main_page_info_for_companies_title_item_6": "Анонімність",
    "main_page_info_for_companies_text_item_6": "Підтримка протоколу анонімізації Tor (опція, яка дозволятиме приховати IP-адресу та захистити ваш трафік від перехоплення)",


    "use_dober_title": "Завантажуйте та використовуйте Dober на вашому смартфоні (IOS та Android), десктопі (через Web-застосунок) чи планшеті",
    "use_dober_text": "Безпечно. Анонімно. Безкоштовно. Без спаму, реклами та без збору персональних даних",

    "download_page_title": "Dober для вашого використання"
  }