{
    "home": "Головна",
    "product": "Продукт",
    "features": "Можливості",
    "security": "Безпека",
    "companies": "Для компаній",
    "help": "Довідка",
    "donate": "Пожертвувати",
    "download": "Завантажити",
    "language": "UA",
    "subscribe": "Підпишіться на новини",

    "button_learn_more": "Дізнайтесь більше.", 

    "main_page_title": "Платформа для всіх ваших захищених внутрішніх і корпоративних комунікацій. Конфіденційність у комунікації.",
    "main_page_first_section_left_title": "Для особистого та сімейного використання.",
    "main_page_first_section_left_text": "Якщо ви цінуєте вашу безпеку та захищеність — додаток Dober саме для вас. Безпечно. Анонімно. Безкоштовно. Без спаму, реклами та без збору персональних даних",
    "main_page_first_section_right_title": "Інформація для корпоративного використання",
    "main_page_first_section_right_text": "Dober забезпечує багаторівневе шифрування та довірене зʼєднання з серверами. Безпечні push-повідомлення гарантують отримання сповіщень без розголошення контенту повідомлень чи метаданих операційній системі. Тож, якщо ви цінуєте безпеку та анонімність, Dober – це чудове рішення для вашого бізнесу. Контроль витоку корпоративної інформації більше не буде проблемою.",

    "main_page_possibilities_title": "Наші можливості",
    "main_page_possibilities_text": "Месенджер для тих, хто цінує свою приватність. Спілкуйтесь анонімно та безпечно без розголошення вашої приватної інформації. Без реклами, спаму та збору даних.",
    "main_page_possibilities_feature_1_title": "Конфіденційність.",
    "main_page_possibilities_feature_1_text": "Це не додаткова маркетингова опція, а принцип, який ми сповідуємо та за яким працюємо. До сервера мають доступ лише довірені особи",
    "main_page_possibilities_feature_2_title": "Безпека.",
    "main_page_possibilities_feature_2_text": "Вам не потрібно хвилюватись стосовно історії спілкування. Ми гарантуємо захист вашої інформації в разі втрати мобільного пристрою чи інших девайсів.",
    "main_page_possibilities_feature_3_title": "Мобільність.",
    "main_page_possibilities_feature_3_text": "Ми доступні на усіх платформах: IOS, Android та Web. Збирайте своїх добре вам знайомих людей у групових чатах.",
    "main_page_possibilities_feature_4_title": "Анонімність.",
    "main_page_possibilities_feature_4_text": "Відсутня привʼязка до мобільного номеру телефону чи електронної пошти.",
    "main_page_possibilities_feature_5_title": "Функціональність.",
    "main_page_possibilities_feature_5_text": "Інтуїтивно зрозумілий та приємний інтерфейс. Звичний та ефективний набір функцій, таких як групові чати та персональні чати, обмін файлами та документами.",
    "main_page_possibilities_feature_6_title": "Шифрування.",
    "main_page_possibilities_feature_6_text": "Багаторівневе шифрування дзвінків та повідомлень, що гарантує додаткову безпеку. Довірене зʼєднання між серверами. Безпечні push-повідомлення, які дозволяють відображати текст повідомлення без загрози безпеці та без передачі метаданих.",


    "download_page_title": "Dober для вашого використання"
  }