{
    "home": "Головна",
    "product": "Продукт",
    "features": "Можливості",
    "security": "Безпека",
    "companies": "Для компаній",
    "help": "Довідка",
    "donate": "Donate",
    "download": "Завантажити",
    "language": "UA",
    "subscribe": "Соціальні мережі",
    "contacts": "Контакти",

    "button_learn_more": "Дізнайтесь більше", 

    "main_page_title": "Платформа для всіх ваших захищених внутрішніх і корпоративних комунікацій. Конфіденційність у комунікації.",
    "main_page_first_section_left_title": "Для особистого та сімейного використання.",
    "main_page_first_section_left_text": "Якщо ви цінуєте вашу безпеку та захищеність — додаток Dober саме для вас. Безпечно. Анонімно. Безкоштовно. Без спаму, реклами та без збору персональних даних",
    "main_page_first_section_right_title": "Інформація для корпоративного використання",
    "main_page_first_section_right_text": "Dober забезпечує багаторівневе шифрування та довірене зʼєднання з серверами. Безпечні push-повідомлення гарантують отримання сповіщень без розголошення контенту повідомлень чи метаданих операційній системі. Тож, якщо ви цінуєте безпеку та анонімність, Dober – це чудове рішення для вашого бізнесу. Контроль витоку корпоративної інформації більше не буде проблемою.",

    "main_page_possibilities_title": "Наші можливості",
    "main_page_possibilities_text": "Месенджер для тих, хто цінує свою приватність. Спілкуйтесь анонімно та безпечно без розголошення вашої приватної інформації. Без реклами, спаму та збору даних.",
    "main_page_possibilities_feature_1_title": "Конфіденційність.",
    "main_page_possibilities_feature_1_text": "Це не додаткова маркетингова опція, а принцип, який ми сповідуємо та за яким працюємо. До сервера мають доступ лише довірені особи",
    "main_page_possibilities_feature_2_title": "Безпека.",
    "main_page_possibilities_feature_2_text": "Вам не потрібно хвилюватись стосовно історії спілкування. Ми гарантуємо захист вашої інформації в разі втрати мобільного пристрою чи інших девайсів.",
    "main_page_possibilities_feature_3_title": "Мобільність.",
    "main_page_possibilities_feature_3_text": "Ми доступні на усіх платформах: IOS, Android та Web. Збирайте своїх добре вам знайомих людей у групових чатах.",
    "main_page_possibilities_feature_4_title": "Анонімність.",
    "main_page_possibilities_feature_4_text": "Відсутня привʼязка до мобільного номеру телефону чи електронної пошти.",
    "main_page_possibilities_feature_5_title": "Функціональність.",
    "main_page_possibilities_feature_5_text": "Інтуїтивно зрозумілий та приємний інтерфейс. Звичний та ефективний набір функцій, таких як групові чати та персональні чати, обмін файлами та документами.",
    "main_page_possibilities_feature_6_title": "Шифрування.",
    "main_page_possibilities_feature_6_text": "Багаторівневе шифрування дзвінків та повідомлень, що гарантує додаткову безпеку. Довірене зʼєднання між серверами. Безпечні push-повідомлення, які дозволяють відображати текст повідомлення без загрози безпеці та без передачі метаданих.",

    "main_page_security_title": "Безпека",
    "main_page_security_text_par_1": "Ваш аккаунт у Dober не привʼязується до номеру телефону чи електронної пошти, гарантуючи анонімність. Ваше спілкування у застосунку захищене від стороннього несанкціонованого доступу. Ми не передаємо особисті дані користувачів стороннім компаніям чи державним органам.", 
    "main_page_security_text_par_2": "Застосунок не зберігає ваші особисті дані, а також шифрує вашу персональну інформацію, таку як IP-адреса чи список контактів. Ми гарантуємо безпечне зберігання даних.",
    "main_page_security_text_par_3": "Додаткові функції, які підвищують рівень вашої безпеки, як то сповіщення учасників чату про зроблений знімок екрана у листуванні, яку неможливо вимкнути.",

    "main_page_advantages_title": "Наші переваги",
    "main_page_advantages_text_1": "Використання наскрізного шифрування за замовчуванням",
    "main_page_advantages_text_2": "Відсутність збору особистих даних користувача",
    "main_page_advantages_text_3": "Шифрування персональної інформації (IP-адреса, список контактів)",
    "main_page_advantages_text_4": "Застосування надійних криптографічних алгоритмів",
    "main_page_advantages_text_5": "Зберігання даних користувача",
    "main_page_advantages_text_6": "Захист листування від доступу до нього адміністрації додатка",
    "main_page_advantages_text_7": "Доступ за PIN-кодом або фразою-паролем (відсутній доступ за допомогою систем розпізнавання облич)",
    "main_page_advantages_text_8": "Захист особистих даних від передачі їх державним органам безпеки",
    "main_page_advantages_text_9": "Можливість анонімної реєстрації",
    "main_page_advantages_text_10": "Можливість повного видалення облікового запису з системи",
    "main_page_advantages_text_11": "Сповіщення учасників чату про зроблений знімок екрана листування",
    "main_page_advantages_text_12": "Виділений сервер (окремий фізичний сервер)",

    "main_page_info_for_companies_title": "нформація для корпоративного використання",
    "main_page_info_for_companies_text": "Захищений корпоративний месенджер для звʼязку та взаємодії з вашими колегами в будь-який час, де б ви не знаходились. Корпоративний месенджер Dober – це рішення під ключ, тільки ви будете контролювати доступ до вашої внутрішньої інформації. Реєстрація відбувається без корпоративної пошти, без номерів телефонів, доступ матимуть лише перевірені користувачі. Це месенджер без ризику витоку корпоративної інформації чи будь-яких важливих бізнес документів.",
    "main_page_info_for_companies_title_item_1": "Зручність або Робіть все в одному місц",
    "main_page_info_for_companies_text_item_1": "Комфортне та швидке спілкування з колегами в безпечному середовищі, де немає нічого зайвого. Працюйте де завгодно і коли завгодно з будь-якого зручного для вас пристрою",
    "main_page_info_for_companies_title_item_2": "Безпека",
    "main_page_info_for_companies_text_item_2": "Робочі документи більше не будуть потрапляти на приватний телефон співробітників чи в інші приватні месенджери без вашого відома. Dober – це месенджер без ризиків витоку корпоративної інформації чи інших бізнес документів. Повний контроль над інформацією та платформою, адже вся зовнішня та внутрішня комунікація відбувається через ваш сервер",
    "main_page_info_for_companies_title_item_3": "Мобільність",
    "main_page_info_for_companies_text_item_3": "Зручний та інтуїтивно зрозумілий інтерфейс. Інтеграція з корпоративною адресною книгою. Збереження часу та продуктивності, завдяки тому, що всі важливі функції будуть поруч, а саме: звичайні чати, групові чати, обмін файлами та документами. Доступний на усіх платформах",
    "main_page_info_for_companies_title_item_4": "Ізольований корпоративний сервер",
    "main_page_info_for_companies_text_item_4": "Використовується ваш власний корпоративний сервер з довільним розміщенням. Виділений сервер, який може працювати без звʼязку з зовнішнім світом. Адміністрація месенджера не має жодних доступів до вашого сервера, навіть для сповіщень",
    "main_page_info_for_companies_title_item_5": "Приватність",
    "main_page_info_for_companies_text_item_5": "Аккаунт користувача не прив’язаний до його біометричних чи контактних даних. Відсутність збору інформації про ваше місцезнаходження чи вашу присутності в мережі.",
    "main_page_info_for_companies_title_item_6": "Анонімність",
    "main_page_info_for_companies_text_item_6": "Підтримка протоколу анонімізації Tor (опція, яка дозволятиме приховати IP-адресу та захистити ваш трафік від перехоплення)",


    "use_dober_title": "Завантажуйте та використовуйте Dober на вашому смартфоні (IOS та Android), десктопі (через Web-застосунок) чи планшеті",
    "use_dober_text": "Безпечно. Анонімно. Безкоштовно. Без спаму, реклами та без збору персональних даних",

    "download_page_title": "Dober для вашого використання",

    "terms_page_title": "Правила використання dober",

    "help_page_question_1": "Чому Dober унікальний?",
    "help_page_answer_1": "Вам не потрібно надавати будь-яку особисту інформацію (наприклад, номер телефону чи адресу електронної пошти), щоб використовувати Dober. У Dober уся ваша комунікація зашифрована наскрізно – текстові повідомлення, голос, відео, файли та групові чати Dober підтримує підключення до мережі TOR із коробки, щоб ніхто не дізнався про ваше мережеве розташування",
    "help_page_question_2": "Що таке Nickname (псевдонім) у Dober?",
    "help_page_answer_2": "Унікальне кодове ім'я Облікового запису, за яким інші Користувачі можуть знайти ваш Обліковий запис у глобальному пошуку Месенджера. Нікнейм повинен складатися із символів, знаків і латинських літер від 1 до 128, водночас не можна створити нікнейм, що складатиметься тільки із символів/знаків/цифр. Допустиме використання \"нижнього підкреслення\". Нікнейм не може збігатися з логіном, а також не може містити спецсимволи та пробіли. Якщо ви створюєте нікнейм, який вже використовується іншим Користувачем, ви не зможете вибрати і створити ідентичний нікнейм. У разі, якщо вам необхідно змінити нікнейм, ви можете змінити його в \"Налаштуваннях Облікового запису\"",
    "help_page_question_3": "Чи можна використовувати Dober у корпоративному середовищі?",
    "help_page_answer_3": "Dober створювався для бізнес потреб та роботи з виділеними серверами. Для роботи в корпоративному середовищі необхідно придбати серверну ліцензію та використовувати програму Dober Business",
    "help_page_question_4": "Чи можна використовувати Dober без SIM-картки?",
    "help_page_answer_4": "Для використання Dober абсолютно не потрібен номер телефону та SIM-картка. Необхідний лише доступ до інтернету",
    "help_page_question_5": "Чи можна використовувати Dober без електронної пошти?",
    "help_page_answer_5": "Для використання Dober абсолютно не потрібна електронна пошта",
    "help_page_question_6": "Чи можна використовувати Dober на кількох пристроях одночасно?",
    "help_page_answer_6": "Так. Встановіть на кілька пристроїв Dober і введіть логін і пароль від одного й того ж облікового запису",
    "help_page_question_7": "Навіщо потрібний ПІН-код при вході до облікового запису?",
    "help_page_answer_7": "Пін код буде запитуватися при кожному вході до Месенджера як додатковий спосіб захисту від доступу третіх осіб до вашого Облікового запису та даних, що зберігаються в ньому. Пін код не прив'язаний до face id та/або будь-якого іншого способу ідентифікації за біометрією. У разі, якщо ви не хочете вводити пін код при кожному вході в Месенджер, ви можете зберегти його, натиснувши \"зберегти код\" у спливаючому вікні (pop-up). Після цього пін код буде збережено і вхід до Месенджера здійснюватиметься без необхідності введення пін коду",
    "help_page_question_8": "Як і де Dober зберігає файли?",
    "help_page_answer_8": "Dober зберігає історію листування на сервері у зашифрованому вигляді. Також медіа контент (відео, фото, аудіо, файли) зберігається на пристрої користувача у вигляді крипто контейнерів і розшифровується тільки в момент звернення до них через Dober",
    "help_page_question_9": "Чи можу я створювати нотатки в Dober?",
    "help_page_answer_9": "Так. Для цього створено спеціальний розділ \"Мої нотатки\". Дані цього розділу зберігаються на сервері у зашифрованому вигляді та доступні лише власнику облікового запису. Якщо в цьому розділі є медіа контент, то він також зберігається і на телефоні у вигляді криптоконтейнерів і розшифровується тільки при зверненні до нього через програму Dober, коли користувач входить до розділу \"Мої нотатки\"",
    "help_page_question_10": "Чому Dober безпечний для спілкування?",
    "help_page_answer_10_1": "Система побудована як Zero-knowledge Service з наскрізним (end-to-end) шифруванням, гарантуючи, що тільки ви та адресат зможете розшифрувати та прочитати інформацію: вся інформація на сервері зберігається у зашифрованому клієнтською стороною вигляді, і якщо навіть зловмисник фізично заволодіє сервером, він залишиться ні з чим, що і було підтверджено групою експертів-криптоаналітиків, які санкціоновано отримали доступ до тестової серверної установки з метою перевірити стійкість нашого ПЗ до криптографічних атак і спробувавши доступитися до інформації всередині вибудованого цифрового захисту. Крім того, все, що стосується листування між групою користувачів (два і більше учасників), ніяк не зможуть побачити інші користувачі на цьому сервері - свого роду ізоляція груп і чатів від інших користувачів і від зломщиків; ",
    "help_page_answer_10_2": "Список алгоритмів, використаних у схемі шифрування: (secp521r1/threefish512/ChaCha20-Poly1305/SHA3-512) ",
    "help_page_answer_10_3": "Режим наскрізного шифрування увімкнено за замовчуванням. Більше того, жодного іншого режиму не передбачено;",
    "help_page_answer_10_4": "Застосовано техніку забезпечення максимального уповільнення атаки перебору паролів для захисту від злому пароля основної пари ключів; PBDKF варіація - асиметричні ключі мають максимальний можливий розмір; ",
    "help_page_answer_10_5": "Асиметричні ключі використовуються тільки для шифрування симетричних ключів повідомлень та ключів процесу аутентифікації, що унеможливлює накопичення статистики для злому;",
    "help_page_answer_10_6": "Усі симетричні ключі мають розмір 512 біт, при тому, що вважається - навіть 128 біт симетричного ключа забезпечують достатню безпеку;",
    "help_page_answer_10_7": "Кожне нове повідомлення зашифроване з використанням нового симетричного 512-бітного ключа, що отримується з джерела криптографічно стійкої послідовності випадкових чисел; OpenSSL ",
    "help_page_answer_10_8": "Кожне повідомлення засвідчено автентикаційною інформацією – електронним цифровим підписом (ЕЦП) автора до тексту повідомлення, що виключає можливість підробки;",
    "help_page_question_11": "Як порівняти Dober з іншими месенджерами?",
    "help_page_answer_11": "Порівняти Dober з популярними месенджерами можна за посиланням __________",
    "help_page_question_12": "Чи можете ви розшифрувати мої повідомлення?",
    "help_page_answer_12": "Ні, не можемо. На серверах Dober не зберігаються паролі користувачів, а також не зберігаються хеш функції паролів. Зберігаються лише ключі шифрування зашифровані паролем користувача. Тому розшифрувати ключі для подальшого використання може лише особа, яка знає пароль. Dober не перевіряє рівень складності пароля, але в міру введення Користувачем пароля Dober може вказувати рівень його складності. Dober рекомендує створювати надійний пароль і не використовувати як пароль поширені слова або набори символів, які легко вгадати або відтворити методом підбору.",
    "help_page_question_13": "Яка мінімальна версія Android підтримується?",
    "help_page_answer_13": "Мінімально необхідна версія Android - 9",
    "help_page_question_14": "Які дозволи потрібні застосунку і для чого?",
    "help_page_answer_14_1": "Для роботи всіх функцій додатку необхідні такі дозволи: ",
    "help_page_answer_14_2": "доступ до камери – для запису відео повідомлень та зйомки фото ",
    "help_page_answer_14_3": "доступ до пам'яті телефону – для збереження медіа повідомлень до галереї та пересилання файлів ",
    "help_page_answer_14_4": "доступ до мікрофона – для запису аудіо повідомлень ",
    "help_page_answer_14_5": "доступ до повідомлень – для повідомлення користувача про нове повідомлення",
    "help_page_answer_14_6": "доступ до мережі – для доступу до серверів через Інтернет",
    "help_page_question_15": "Чи видаляться мої дані, якщо я перевстановлю програму?",
    "help_page_answer_15": "При перевстановленні програми видаляться локально збережені дані, але історія листування на сервері залишиться і після нової установки програми та входу в обліковий запис з логіном паролем буде доступна користувачеві",
    "help_page_question_16": "Як зберегти медіа файли?",
    "help_page_answer_16_1": "В одиночному або груповому чаті викликати меню повідомлення та вибрати пункт - Завантажити. Папки, в яких Dober зберігає збережені вкладення: ",
    "help_page_answer_16_2": "Downloads/Dober/Audio ",
    "help_page_answer_16_3": "Downloads/Dober/Files ",
    "help_page_answer_16_4": "Downloads/Dober/Pictures ",
    "help_page_answer_16_5": "Downloads/Dober/Video",
    "help_page_question_17": "Чи можна зберегти файли та історію листування на Google Drive або iCloud?",
    "help_page_answer_17": "Звісно ні, це суперечить правилам безпеки. Інформація зберігається виключно на серверах Dober у зашифрованому вигляді та на смартфоні користувача у вигляді крипто контейнерів",
    "help_page_question_18": "Чи є синхронізація з телефонною книгою?",
    "help_page_answer_18": "Ні, це суперечить правилам анонімності та може опосередковано допомогти визначити особистість користувачів",
    "help_page_question_19": "Що означає іконка біля аватарки групи?",
    "help_page_answer_19": "Іконка символізує групу і підказує чи є хтось із учасників групи онлайн. Якщо хоч один учасник гурту онлайн – іконка стає зеленою",
    "help_page_question_20": "Чи можна остаточно видалити повідомлення з Dober та як це зробити?",
    "help_page_answer_20": "Так можна. Для цього необхідно зайти в одиночний або груповий чат, викликати меню повідомлення та вибрати пункт Видалити. Видалити можна лише свої повідомлення. Ця функція видаляє повідомлення з бази даних і перезаписує комірку випадковим набором символів, щоб уникнути відновлення інформації спеціальними програмами."
  }