"use client"

import { useTranslation } from "react-i18next";
import { useRef, useEffect } from "react";
import Link from "next/link";

import styles from "../assets/styles/info-pages.module.scss";
import Navigation from "../components/terms/Navigation";

export default function Terms() {

    const { t } = useTranslation();
    
    const ref_1 = useRef(null);
    const ref_2 = useRef(null);
    const ref_3 = useRef(null);
    const ref_4 = useRef(null);
    const ref_5 = useRef(null);
    const ref_6 = useRef(null);
    const ref_7 = useRef(null);
    const ref_8 = useRef(null);
    const ref_9 = useRef(null);
    const ref_10 = useRef(null);
    const ref_11 = useRef(null);
    const ref_12 = useRef(null);
    const ref_13 = useRef(null);
    const ref_14 = useRef(null);
    const ref_15 = useRef(null);
    const ref_16 = useRef(null);
    const ref_17 = useRef(null);
    const ref_18 = useRef(null);

    const scrollToHeader = (ref) => {
        if (ref.current) {
        ref.current.scrollIntoView({ behavior: 'smooth' });
        }
    };

    return (
        <section className="container">
            <div style={{padding: "0 30px"}}>
                <h2>ПРАВИЛА ВИКОРИСТАННЯ DOBER</h2>
                <div className={styles["introduction"]}>
                    <p>Діють з 1 квітня 2023 року.</p>
                    <p>
                        Ці Умови використання (далі - або Умови) регулюють використання вами Месенджера Dober та інших веб-ресурсів Dober, а також процес надання доступу до функціоналу Месенджера, що розроблений фізичною особою-підприємцем: Оберемок Д.П., код ЄДРПОУ: 3195118838 (далі "Dober", "ми", "наш", "нас")
                    </p>
                    <p>
                        Умови використання регулюються і тлумачаться відповідно до законодавства України та набувають чинності після реєстрації Користувача - створення ним Облікового запису в Месенджері.
                    </p>
                    <p>
                        Ці Умови визначають правила взаємодії між Dober і зареєстрованою особою, яка використовує Месенджер (далі "Користувач", "ви", "вас", "ваш").
                    </p>
                </div>
                {/* <Navigation blockRefs={blockRefs} scrollToRef={scrollToRef} styles={styles} t={t}/> */}
                <ol className={styles["navigation"]}>
                    <li onClick={() => scrollToHeader(ref_1)}>ЩО ТАКЕ DOBER</li>
                    <li onClick={() => scrollToHeader(ref_2)}>УГОДА КОРИСТУВАЧА</li>
                    <li onClick={() => scrollToHeader(ref_3)}>ВІКОВЕ ОБМЕЖЕННЯ</li>
                    <li onClick={() => scrollToHeader(ref_4)}>ПРАВИЛА КОРИСТУВАННЯ МЕСЕНДЖЕРОМ</li>
                    <li onClick={() => scrollToHeader(ref_5)}>ПОРУШЕННЯ УМОВ ВИКОРИСТАННЯ</li>
                    <li onClick={() => scrollToHeader(ref_6)}>РЕЄСТРАЦІЯ</li>
                    <li onClick={() => scrollToHeader(ref_7)}>СЕКРЕТНЕ ЗАПИТАННЯ-ВІДПОВІДЬ І ПІН-КОД</li>
                    <li onClick={() => scrollToHeader(ref_8)}>ПІДПИСКА ТА ОПЛАТА</li>
                    <li onClick={() => scrollToHeader(ref_9)}>СТВОРЕННЯ ЧАТІВ І ГРУП</li>
                    <li onClick={() => scrollToHeader(ref_10)}>БЛОКУВАННЯ КОРИСТУВАЧІВ</li>
                    <li onClick={() => scrollToHeader(ref_11)}>НАЛАШТУВАННЯ ОБЛІКОВОГО ЗАПИСУ</li>
                    <li onClick={() => scrollToHeader(ref_12)}>ВИДАЛЕННЯ ОБЛІКОВОГО ЗАПИСУ</li>
                    <li onClick={() => scrollToHeader(ref_13)}>ВІДМОВА ВІД ГАРАНТІЙ. ОБМЕЖЕННЯ ВІДПОВІДАЛЬНОСТІ</li>
                    <li onClick={() => scrollToHeader(ref_14)}>ЗОВНІШНІ ПОСИЛАННЯ</li>
                    <li onClick={() => scrollToHeader(ref_15)}>ЗАСТОСОВНЕ ПРАВО, ЮРИСДИКЦІЯ</li>
                    <li onClick={() => scrollToHeader(ref_16)}>ПРАВО НА ВИКОРИСТАННЯ DOBER. ІНТЕЛЕКТУАЛЬНА ВЛАСНІСТЬ</li>
                    <li onClick={() => scrollToHeader(ref_17)}>БЕЗПЕКА ТА КОНФІДЕНЦІЙНІСТЬ</li>
                    <li onClick={() => scrollToHeader(ref_18)}>ПІДТРИМКА КОРИСТУВАЧІВ ПЛАТФОРМИ</li>
                </ol>
                <div className={styles["list"]}>
                    <ol style={{padding: 0}}>
                        <li>
                            <strong ref={ref_1}>Що таке dober</strong>
                            <ol style={{padding: 0}}>
                                <li>
                                    <strong>Месенджер Dober</strong> - безкоштовний мобільний додаток захищеного спілкування для Android та iOS, а також веб версія Месенджера. Месенджер дає змогу   Користувачам обмінюватися текстовими повідомленнями, надсилати відео та зображення в чатах і створювати Групи для спілкування необмеженої кількості Користувачів.   
                                </li>
                                <li>
                                    <strong>Переваги Dober :</strong>
                                    <ol>
                                        <li>Постквантове наскрізне шифрування даних, яке забезпечує їхню конфіденційність.</li>
                                        <li>Захищене централізоване зберігання даних.</li>
                                        <li>Захищений обмін файлами та повідомленнями в групах і чатах.</li>
                                        <li>Конфіденційність Користувачів і контроль Користувача над інформацією.</li>
                                        <li>Відсутність прив'язки Облікового запису Користувача до номера мобільного телефону або адреси електронної пошти.</li>
                                        <li>Можливість використання Сервера Бізнес-акаунта (конфіденційна інформація з Бізнес-акаунта не зберігається на пристроях Користувачів, втрата пристрою не призведе до втрати інформації)су Користувача до номера мобільного телефону або адреси електронної пошти.</li>
                                    </ol>
                                </li>
                            </ol>
                        </li>
                        <li>
                            <strong ref={ref_2}>Угода користувача</strong>
                            <ol>
                                <li>Будь ласка, уважно прочитайте ці <Link href="/privacy-polity" style={{color: "blue", textDecoration: 'underline'}}>Умови та Політикою конфіденційності</Link> Dober до початку користування Месенджером, після чого позначте свою згоду з ними у спливаючому вікні на екрані вашого девайса (pop-up). Якщо ви не позначите свою згоду дотримуватися Умов використання та Політики конфіденційності, ви не зможете отримати доступ до Месенджера. </li>
                                <li><strong>Dober</strong> намагається постійно покращувати та розширювати функціонал Месенджера, крім того, ми стежимо за дотриманням чинного законодавства, тому час від часу ми можемо вносити зміни до Умов використання Dober. Зміни цих Умов набувають чинності з моменту опублікування оновленої версії. При внесенні змін до Умов ми оновимо дату, з моменту якої оновлені Умови використання вступили в дію, у верхній частині наших Умов. </li>
                                <li>
                                    Користувач погоджується і визнає, що Dober може переглянути Умови використання або будь-яку їх частину. Оновлені Умови використання будуть розміщені в загальнодоступній формі в Месенджері або повідомлення про зміну Умов будуть відображені при первинному відкритті Месенджера після такого оновлення. Використання Месенджера після такого повідомлення означає прийняття Користувачем змінених Умов використання. Версія Умов використання, що відображається в даний момент у Месенджері, має пріоритет над усіма попередніми версіями.
                                </li>
                                <li>
                                    Якщо ви не згодні з Умовами, будь-якими змінами до них, ви можете припинити використання Dober, видалити Обліковий запис і Месенджер Dober зі своїх девайсів.
                                </li>
                                <li>
                                    Користувач не може вважати Dober відповідальним за шкоду, яка може виникнути внаслідок використання Месенджера. 
                                </li>
                                <li>
                                    Користувач зобов'язується самостійно оцінювати правомірність використання Месенджера відповідно до чинного законодавства країни, резидентом якої він є. Ми не робимо заяв про те, що Месенджер доступний для використання або дозволений законом у будь-якому конкретному місці. Якщо ви використовуєте Месенджер, ви робите це за власною ініціативою і несете відповідальність за дотримання застосовних місцевих законів.
                                </li>
                                <li>
                                    Користувач дає згоду на отримання сповіщень та повідомлень Месенджера. Така згода діятиме на постійній основі доти, доки Користувач не відкличе її, застосувавши відповідні налаштування свого девайса.
                                </li>
                            </ol>
                        </li>
                        <li>
                            <strong ref={ref_3}>Вікове обмеження</strong>
                            <ol>
                                <li>
                                    Месенджер не призначений для використання особами віком до 16 років. Якщо вам ще немає 16 років, просимо не використовувати Месенджер Dober до досягнення цього віку.
                                </li>
                                <li>
                                    Якщо вам стало відомо, що особа віком до 16 років використовує Dober, повідомте нам про це, будь ласка, за адресою support@dober.chat, щоб ми могли вирішити цю ситуацію оперативно.
                                </li>
                            </ol>
                        </li>
                        <li>
                            <strong ref={ref_4}>Правила користування Месенджером</strong>
                            <ol>
                                <li>
                                    Ви можете використовувати Месенджер тільки в законних цілях і відповідно до цих Умов. Користувачам заборонено зберігати, поширювати або передавати будь-які незаконні матеріали через Месенджер. Використання Месенджера в незаконних цілях може потягнути за собою кримінальну або цивільну відповідальність, видалення або призупинення дії вашого Облікового запису.
                                </li>
                                <li>
                                    Користувач гарантує, що :
                                    <ol>
                                        <li>
                                            є фізичною дієздатною особою не молодше 16 років;
                                        </li>
                                        <li>
                                            не перешкоджатиме або не заборонятиме іншим Користувачам використовувати Месенджер, включно із застосуванням засобів "злому" або псування Месенджера;
                                        </li>
                                        <li>
                                            не намагатиметься видати себе за іншого Користувача або використовувати нікнейм іншого Користувача;
                                        </li>
                                        <li>
                                            не використовуватиме Месенджер у будь-яких незаконних цілях і будь-яким способом, не дозволеним цими Умовами та Політикою конфіденційності;
                                        </li>
                                        <li>
                                            не збиратиме та/або не зберігатиме інформацію про Користувачів Месенджера;
                                        </li>
                                        <li>
                                            не використовуватиме будь-який пристрій або процес для втручання у функції Месенджера, пов'язані з безпекою, включно з функціями, що запобігають або обмежують використання чи копіювання будь-якого контенту або вводять обмеження на використання Месенджера;
                                        </li>
                                        <li>
                                            не передаватиме через Месенджер будь-яке програмне забезпечення або інші матеріали, що містять вірус або інший шкідливий чи руйнівний компонент;
                                        </li>
                                        <li>
                                            не використовуватиме Месенджер як засіб для злочинної змови або схеми, які є незаконними або шкідливими;
                                        </li>
                                        <li>
                                            не буде продавати, в інший спосіб передавати або субліцензувати Месенджер;
                                        </li>
                                        <li>
                                            не буде продавати, в інший спосіб передавати або субліцензувати Месенджер;
                                        </li>
                                        <li>
                                            не порушуватиме чинне законодавство, включно із законами про конфіденційність третіх осіб та їхні права інтелектуальної власності;
                                        </li>
                                        <li>
                                            не буде створювати і множити неправдиві Облікові записи, що вводять в оману;
                                        </li>
                                        <li>
                                            не використовуватиме будь-які автоматизовані засоби або інтерфейси для вилучення даних інших Користувачів.
                                        </li>
                                    </ol>
                                </li>
                            </ol>
                        </li>
                        <li>
                            <strong ref={ref_5}>Правила користування Месенджером</strong>
                            <ol>
                                <li>
                                    <strong>Підозріла діяльність</strong>. Якщо Dober за об'єктивними даними вважає, що Обліковий запис Користувача був причетний до будь-якого порушення законів (шахрайство або інший злочин, правопорушення) або правил, або до нього було отримано доступ незаконним шляхом, або обліковий запис іншим чином залучений до підозрілої діяльності (чи то жертва, підозрюваний, порушник або інша особа), Dober може заблокувати Обліковий запис такого Користувача.
                                </li>
                                <li>Користувачі можуть надсилати Dober скарги про шахрайську або іншу злочинну діяльність інших Користувачів, такі дані будуть оброблятися Dober для виявлення підозрілої, протиправної діяльності Користувачів. Для надсилання скарги Користувачеві необхідно вказати причину скарги та обрати категорію порушення із запропонованих: жорстоке поводження з дітьми, заборонені препарати, особиста інформація, порнографія, спам, насильство, інші.</li>
                                <li>
                                    Якщо Користувач підозрюється в будь-якому порушенні чинного законодавства, Dober у міру необхідності співпрацюватиме з правоохоронними органами.
                                </li>
                            </ol>
                        </li>
                        <li>
                            <strong ref={ref_6}>Реєстрація</strong>
                            <ol>
                                <li>
                                    Для використання Месенджера Користувачеві необхідно створити Обліковий запис. Обробка та зберігання даних, наданих у процесі реєстрації та створення Облікового запису, регулюється <Link href="/privacy-polity" style={{color: "blue", textDecoration: 'underline'}}>Політикою конфіденційності Dober</Link>. 
                                </li>
                                <li>
                                    <strong>Dober</strong> передбачає можливість створення двох типів Облікових записів (акаунтів).
                                    <ol>
                                        <li>
                                            <strong>Особистий акаунт</strong> - Обліковий запис зареєстрованого Користувача Dober.
                                        </li>
                                        <li>
                                            <strong>Бізнес-акаунт</strong> - Обліковий запис Користувача (Бізнес-клієнта), що надає можливість використовувати Месенджер як закритий канал комунікації, доступний лише співробітникам такого Бізнес-клієнта або авторизованим користувачам, доступ яким дозволено Бізнес-клієнтом.
                                            <ol>
                                                <li>
                                                    Бізнес-клієнт використовує Сервер Бізнес-акаунта для зберігання даних, для цього Бізнес-клієнт призначає адміністратора Сервера Бізнес-акаунта, який попередньо створює акаунти Користувачам, які отримають доступ до Бізнес-акаунта. Адміністратор надає Користувачам створений логін і пароль для початкового входу в акаунт, а також адресу сервера для підключення. Логіни Користувачів можуть бути попередньо узгоджені адміністратором з ними. Первинний (стандартний) пароль користувача Бізнес-акаунта не доступний нікому, крім цього Користувача та адміністратора. Після входу до Бізнес-аккаунта Користувач зобов'язаний змінити стандартний пароль на свій унікальний, який буде відомий тільки йому.
                                                </li>
                                            </ol>
                                        </li>
                                        <li>
                                            Для створення Облікового запису Користувачеві необхідно заповнити реєстраційні дані, такі як логін, пароль, ім'я Користувача та нікнейм (псевдонім).
                                            <ol>
                                                <li>
                                                    <strong>Логін</strong>. Користувач повинен створити і ввести логін, який є ідентифікатором Облікового запису. При створенні логіна можна використовувати латинські літери, знаки і символи в кількості від 1 до 128, включно з "нижнім підкресленням", при цьому, спецсимволи і знаки "@", "пробіл" і крапка "." у логіні неприпустимі. Використання в логіні тільки символів або тільки цифр неприпустимо. Зміна логіна після реєстрації Облікового запису неможлива.
                                                </li>
                                                <li>
                                                    <strong>Пароль</strong>. Користувачеві необхідно створити пароль, який може складатися з будь-якої кількості символів і знаків, мінімальний розмір пароля - один знак. При створенні пароля допустимо використання будь-якої мови. Після введення та підтвердження пароля Облікового запису, Користувач повинен підтвердити згоду у спливаючому вікні (pop-up) з тим, що він ознайомлений і згоден з важливістю створеного пароля. У разі, якщо Користувач не підтверджує згоду, реєстрація Облікового запису неможлива. Dober не перевіряє рівень складності пароля, але в міру введення Користувачем пароля Dober може вказувати рівень його складності. Dober рекомендує створювати надійний пароль і не використовувати як пароль поширені слова або набори символів, які легко вгадати або відтворити методом підбору.
                                                </li>
                                                <li>
                                                    <strong>Ім'я Користувача</strong>. Користувач вводить ім'я Облікового запису, яке відображатиметься в адресній книзі інших Користувачів. Для створення імені Користувача ви можете використовувати будь-яку мову, а також кількість знаків і символів від 2 до 128. У разі, якщо вам необхідно змінити ім'я Користувача, ви можете змінити його в "Налаштуваннях Облікового запису".
                                                </li>
                                                <li>
                                                    <strong>Нікнейм (псевдонім)</strong>. Унікальне кодове ім'я Облікового запису, за яким інші Користувачі можуть знайти ваш Обліковий запис у глобальному пошуку Месенджера. Нікнейм повинен складатися із символів, знаків і латинських літер від 1 до 128, водночас не можна створити нікнейм, що складатиметься тільки із символів/знаків/цифр. Допустиме використання "нижнього підкреслення". Нікнейм не може збігатися з логіном, а також не може містити спецсимволи та пробіли. Якщо ви створюєте нікнейм, який вже використовується іншим Користувачем, ви не зможете вибрати і створити ідентичний нікнейм. У разі, якщо вам необхідно змінити нікнейм, ви можете змінити його в "Налаштуваннях Облікового запису".
                                                </li>
                                                <li>
                                                    <strong> Сервер</strong>. Для реєстрації Бізнес-акаунта Користувачеві (Бізнес-клієнту) необхідно ввести адресу сервера, що відповідатиме серверу, на якому Користувач Бізнес-акаунта зберігатиме дані. Після введення адреси сервера Користувач Бізнес-акаунта заповнює такі самі реєстраційні дані як і Користувач Особистого акаунта, а саме: логін, пароль, ім'я Користувача та нікнейм.
                                                </li>
                                            </ol>
                                        </li>
                                        <li>
                                            Dober не контролює і не зобов'язаний контролювати реєстраційні дані та/або безпеку вашого пароля. Ви несете відповідальність за безпеку вашого пароля, а також безпеку вашого пристрою для обмеження доступу до вашого Облікового запису третіх осіб.
                                        </li>
                                        <li>
                                            Dober має функціонал, що дозволяє ідентифікувати дійсного власника Облікового запису. Цей функціонал також може дозволити Користувачеві відновити обліковий запис у разі втрати ним пароля. Шляхом використання відповідних функцій у налаштуваннях облікового запису Користувач може вигадати та вказати секретне слово або набір символів, що будуть відомі лише Користувачеві та доступні службі підтримки Dober. Секретне слово/набір символів ідентифікації Облікового запису не є Секретним питанням-відповіддю, як це описано у розділі 7 цих Умов використання. Для зміни пароля, а також для будь-якого іншого запиту, пов'язаного з Обліковим записом, особистість Користувача і факт володіння Обліковим записом повинні бути підтверджені шляхом надання секретного слова/набору символів службі підтримки Dober, що, своєю чергою, свідчитиме про те, що запит з більшою ймовірністю надійшов від дійсного власника Облікового запису і може бути виконаний. Секретне слово/набір символів не є обов'язковим під час реєстрації Облікового запису Користувача і може бути додане ним у будь-який час під час використання налаштувань Облікового запису Dober.
                                        </li>
                                        <li>
                                            Ви несете відповідальність за всі дії, які відбуваються під вашим Обліковим записом у Месенджері. Ви погоджуєтеся негайно повідомити Dober про будь-яке несанкціоноване використання вашого Облікового запису або будь-яке порушення безпеки щодо вашого Облікового запису, включно з використанням (зломом) пароля.
                                        </li>
                                        <li>
                                            Dober не несе відповідальності за будь-які збитки, яких ви можете зазнати в результаті використання вашого Облікового запису будь-ким іншим, з вашого відома або без нього. Крім того, ви можете бути притягнуті до відповідальності за будь-які збитки, понесені нами або іншою стороною в результаті використання вашого Облікового запису іншою особою.
                                        </li>
                                    </ol>
                                </li>
                            </ol>
                        </li>
                        <li>
                            <strong ref={ref_7}>СЕКРЕТНЕ ЗАПИТАННЯ-ВІДПОВІДЬ І ПІН-КОД</strong>
                            <ol>
                                <li>
                                    <strong>Секретне запитання-відповідь</strong>. Після реєстрації Облікового запису Користувачам рекомендується створити додаткове "питання", "відповідь" і "підказку" для відновлення доступу до Облікового запису в разі втрати пароля (далі - "Секретне питання-відповідь"). Користувач може відмовитися від створення такого Секретного питання-відповіді, в такому випадку Dober не несе відповідальність за відновлення доступу до Облікового запису Користувача. У разі, якщо ви втрачаєте доступ до Облікового запису через втрату пароля, Dober не зможе відновити або надати доступ до такого Облікового запису та даних, які пов'язані з ним.
                                </li>
                                <li>
                                    Для створення Секретного запитання-відповіді після реєстрації Облікового запису Користувачеві потрібно заповнити рядки "питання", "відповідь", "підказка". Ви можете використовувати необмежену кількість символів і знаків.
                                </li>
                                <li>
                                    При відновленні доступу до Облікового запису Користувач повинен ввести дані Секретного питання-відповіді повністю, враховуючи пробіли, знаки, мову, цифри і всі символи, які були ним використані при створенні такого Секретного питання-відповіді. Підказка, яка створена для допомоги відповіді на Секретне питання-відповідь, зберігається на сервері у відкритому вигляді, ми не рекомендуємо писати повну відповідь на Секретне питання-відповідь у підказці.
                                </li>
                                <li>
                                    У разі, якщо на етапі реєстрації Облікового запису Користувач не створив Секретне питання-відповідь, забув цю інформацію або не створив підказку для її відновлення, для зміни Секретного питання-відповіді Користувачеві необхідно перейти до "Налаштувань Облікового запису" та змінити поточний пароль, обравши функцію "Зміна паролю", ввести поточний пароль Облікового запису, потім обрати та заповнити нове Секретне питання-відповідь.
                                </li>
                                <li>
                                    <strong>Пін код</strong>. Для забезпечення додаткового захисту Облікового запису Користувачі можуть створювати пін код для входу в Месенджер. Мінімальна кількість символів пін коду - чотири, Dober не обмежує максимальну кількість знаків і символів, які ви можете використовувати при створенні пін коду.
                                </li>
                                <li>
                                    Пін код буде запитуватися при кожному вході до Месенджера як додатковий спосіб захисту від доступу третіх осіб до вашого Облікового запису та даних, що зберігаються в ньому. Пін код не прив'язаний до face id та/або будь-якого іншого способу ідентифікації за біометрією. У разі, якщо ви не хочете вводити пін код при кожному вході в Месенджер, ви можете зберегти його, натиснувши "зберегти код" у спливаючому вікні (pop-up). Після цього пін код буде збережено і вхід до Месенджера здійснюватиметься без необхідності введення пін коду.
                                </li>
                            </ol>
                        </li>
                        <li>
                            <strong ref={ref_8}>Підписка та оплата</strong>
                            <ol>
                                <li>
                                    Dober є безкоштовним Месенджером, тому для реєстрації Облікового запису та його використання Користувачеві не потрібно вносити плату або оформляти підписку.
                                </li>
                            </ol>
                        </li>
                        <li>
                            <strong ref={ref_9}>Створення чатів і груп</strong>
                            <ol>
                                <li>
                                    Для створення чатів Користувачеві потрібно натиснути кнопку в нижньому правому куті основної сторінки Облікового запису. Книга контактів вашого пристрою не синхронізується з Месенджером, тому для створення і початку чату з Користувачами вам необхідно знайти їх за ім'ям або по нікнейму у глобальному пошуку Месенджера, натиснути на іконку Облікового запису потрібного вам Користувача і відкрити чат для початку спілкування з ним. Також ви можете додати Користувача у ваші контакти або переглянути інформацію про нього. Ви також можете змінити ім'я доданого до ваших контактів Користувача, така зміна буде відображатися тільки у вас.
                                </li>
                                <li>
                                    У чатах Користувачі можуть обмінюватися повідомленнями, зображеннями, аудіо-відео файлами, стікерами та емодзі, відмічати повідомлення як такі, що сподобалися. Під час надсилання повідомлень і файлів у чаті відображатиметься час і дата надсилання такого повідомлення та файлу. Ви можете завантажувати на свій пристрій, закріплювати, додавати до нотаток, відповідати та ділитися надісланими вам або надісланими вами файлами та повідомленнями з іншими Користувачами Dober і третіми особами, для цього вам потрібно утримувати файл або повідомлення та обрати необхідну вам функцію. Користувачі можуть видаляти відправлені ними повідомлення та файли з чату. Після видалення повідомлення та файли відновленню не підлягають. Також Користувачам доступна опція очищення чату, у разі її застосування листування буде повністю видалено, а чат зникне з історії чатів Користувача. У другого Користувача чат і повідомлення залишаться в незмінному вигляді. Сповіщення Користувача про будь-які дії інших Користувачів з повідомленнями та файлами відсутні. 
                                </li>
                                <li>
                                    Користувач може створити чати з необмеженою кількістю Користувачів для обміну повідомленнями та файлами між ними (далі "Група"). Група може бути створена тільки з доданих у ваші контакти Користувачів. Кількість Користувачів у Групі не обмежена. Додати до Групи Користувачів, яких немає у ваших контактах, неможливо.
                                </li>
                                <li>
                                    У Групах Користувачі можуть надсилати зображення, повідомлення, відео, аудіоповідомлення, стікери та емодзі, а також позначати повідомлення як такі, що сподобалися. Користувачі Групи можуть завантажувати на свій пристрій, закріплювати, додавати до нотаток, відповідати та ділитися надісланими їм або надісланими ними файлами та повідомленнями з іншими Користувачами Dober, що є у книзі контактів Користувача, для цього потрібно утримувати файл або повідомлення та обрати необхідну функцію. Користувачі можуть видаляти відправлені повідомлення та файли. Під час видалення чату Групи або повідомлення, видалення відбудеться тільки в того Користувача, який вибрав опцію "Видалити чат" або "Видалити повідомлення", у другого Користувача або учасників Групи повідомлення або чат Групи залишаться в незмінному вигляді. Сповіщення Користувачів про будь-які дії інших Користувачів із повідомленнями та файлами відсутні.
                                </li>
                                <li>
                                    У Групі Користувачі можуть переглянути склад учасників, вимкнути або увімкнути сповіщення, а також видалитися з Групи. При видаленні з Групи у Користувача зникає Група і повідомлення в ній, для решти учасників Групи повідомлення Користувача залишаються незмінними. Якщо такий Користувач видалить свій акаунт, повідомлення, надіслані таким Користувачем у Групі, залишаться незмінними, а ім'я Користувача в Групі відображатиметься як "Видалений акаунт".
                                </li>
                                <li>
                                    Власник (той, хто створив Групу) та/або адміністратор Групи може здійснювати такі налаштування в Групі: призначати інших Користувачів адміністраторами, додавати і видаляти нових учасників або видалити Групу. Якщо власник Групи видалив свій Обліковий запис, то створена ним Група і повідомлення в ній видаляються без можливості відновлення. Якщо власник Групи перед видаленням свого Облікового запису передав право власника Групи/адміністратора іншому Користувачеві Групи, то вміст Групи та сама Група залишиться в незмінному вигляді, а акаунт первісного власника Групи відображатиметься як "Видалений акаунт".
                                </li>
                                <li>
                                    Якщо будь-який Користувач у чаті або Групі зробить скріншот екрана, у чаті або Групі з'явиться повідомлення про таку дію. Відключити повідомлення про скріншот неможливо.
                                </li>
                                <li>
                                    Користувачі можуть прибирати та вмикати сповіщення та звуки, розставляти чати та Групи в Месенджері в порядку пріоритетності (закріплювати у верхній частині більш важливі та потім міняти їхнє розташування при зміні важливості). Налаштування сповіщень і звуків, порядок розташування чатів і Груп буде відображатися тільки в Обліковому записі Користувача, який зробив такі налаштування.
                                </li>
                                <li>
                                    Повідомлення і дані, що надсилаються всередині Груп і чатів, і будь-який контент, що розміщується або передається через них, підпадає під дію Політики конфіденційності Dober.
                                </li>
                            </ol>
                        </li>
                        <li>
                            <strong ref={ref_10}>Блокування користувачів</strong>
                            <ol>
                                <li>
                                    Користувач може заблокувати будь-якого іншого Користувача, для цього Користувачеві потрібно натиснути на іконку Облікового запису Користувача і вибрати функцію "заблокувати". У разі, якщо ви заблокували Користувача, вам не будуть надходити повідомлення від нього. При цьому, Месенджер не повідомляє Користувача про те, що він був заблокований, ваше листування може відрізнятися, оскільки заблокований Користувач зможе продовжувати надсилати вам повідомлення, які ви не будете отримувати. Ви також не можете відправляти повідомлення заблокованому вами Користувачеві до моменту його розблокування.
                                </li>
                                <li>
                                    Для перевірки заблокованих Користувачів вам необхідно перейти в розділ "заблоковані" в Обліковому записі. У цьому розділі відображатимуться всі заблоковані вами Користувачі та ваші з ними чати до моменту блокування. Ви можете розблокувати заблокованого Користувача, натиснувши "розблокувати". У разі розблокування ви не отримаєте повідомлення, які були надіслані заблокованим Користувачем у період блокування, чат буде відображено у вигляді “до моменту блокування”.
                                </li>
                            </ol>
                        </li>
                        <li>
                            <strong ref={ref_11}>Налаштування облікового запису</strong>
                            <ol>
                                <li>
                                    У налаштуваннях Облікового запису Користувач може змінити або додати зображення Облікового запису (аватар), змінити звук сповіщень, переглянути дані та розмір сховища, побачити пристрої, на яких відкрито Обліковий запис Користувача, змінити мову Месенджера та налаштування чатів.
                                </li>
                                <li>
                                    <strong>Повідомлення та звуки</strong>. Користувач може змінювати налаштування сповіщень, вимикати звук і сповіщення в чатах та/або Групах, а також увімкнути тихий режим, у такому разі Месенджер не надсилатиме сповіщення про отримані повідомлення в чатах і Групах.
                                </li>
                                <li>
                                    <strong>Дані та сховище</strong>. Користувач може подивитися обсяг даних, які зберігаються в Обліковому записі, змінити спосіб завантаження файлів з використанням мережі вай-фай або мобільної мережі, змінити розмір кешу, видалити всі дані або деякі дані, які розділено на 4 категорії: зображення, голосові повідомлення, документи та відео.
                                </li>
                                <li>
                                    <strong>Налаштування чату</strong>. Користувач може змінити розмір шрифту повідомлень і тло в чатах і Групах, для цього потрібно вибрати необхідні параметри налаштувань чату і натиснути кнопку "Застосувати". Такі зміни буде видно тільки Користувачеві, який застосував налаштування у своєму Обліковому записі. 
                                </li>
                                <li>
                                    <strong>Сесія та пристрій</strong>. У момент входу в Обліковий запис Користувача створюється сесія, яка зберігається на Сервер Dober, а в разі використання Сервера Бізнес-акаунта, сесія зберігається на Сервер Бізнес-акаунта. Користувач може переглянути дані про пристрій і всі пристрої, на яких відкрито поточну сесію, а також відключити будь-який пристрій від сесії.
                                </li>
                                <li>
                                    <strong>Мова Месенджера</strong>. Користувач може змінити мову Облікового запису на одну із запропонованих у налаштуваннях Месенджера: українську/російську/англійську.
                                </li>
                                <li>
                                    <strong>Опис про себе</strong>. У налаштуваннях Користувач може додати опис "про себе", змінити зображення та форму зображення Облікового запису, ім'я Користувача та нікнейм. Для зміни імені Користувача, нікнейма та опису Облікового запису виправте ваші дані в полі для заповнення та натисніть зелену галочку, що з'являється в правому кутку біля заповненого поля. У разі, якщо обраний вами нікнейм уже існує, ви можете змінити його тільки на альтернативний нікнейм. Змінити логін Облікового запису неможливо.
                                </li>
                                <li>
                                    <strong>Налаштування безпеки</strong>. Користувач може змінювати налаштування безпеки Облікового запису, які включають в себе: зміну пароля для входу в Обліковий запис, можливість активувати або скасувати відкриття Месенджера за пін кодом. У разі, якщо ви змінюєте налаштування безпеки "вхід за пін кодом", Месенджер відправить вас на сторінку, де ви маєте продублювати свій пін код для скасування або для активації функції входу в Месенджер за пін кодом. У разі зміни пароля Користувачеві необхідно ввести старий пароль, новий пароль і продублювати новий пароль, після чого натиснути кнопку "Продовжити". Після цього пароль буде змінено.
                                </li>
                            </ol>
                        </li>
                        <li>
                            <strong ref={ref_12}>Видалення облікового запису</strong>
                            <ol>
                                <li>
                                    Користувач має право в будь-який час видалити свій Обліковий запис. Для видалення Облікового запису вам необхідно перейти до налаштувань Облікового запису і вибрати "видалити акаунт". Зверніть увагу, що видалення Облікового запису неможливо скасувати. Всі ваші дані видаляться безповоротно і не будуть підлягати відновленню, в тому числі через сервіс підтримки користувачів Dober.
                                </li>
                                <li>
                                Після деактивації Облікового запису дані Користувача повністю видаляться, включно з чатами, Групами, повідомленнями, фото/відео/аудіо файлами та списком контактів. Чати зберігаються у другого Користувача в незмінному вигляді, ім'я видаленого Користувача буде відображатися як "Видалений акаунт". При цьому, Користувач може вручну видалити всі свої повідомлення з чатів або Груп перед видаленням акаунта. <br style={{marginTop: 20}}/>Групи, які були створені Користувачем, після видалення Облікового запису видаляються безповоротно у всіх Користувачів, що були учасниками таких Груп, якщо власник Групи перед видаленням акаунту не передав свої права на Групу іншому Користувачеві. У випадку передачі прав на Групу до видалення акаунта, Група продовжує існувати в первісному вигляді, всі повідомлення в ній зберігаються, а ім'я первісного власника Групи відображається як "Видалений акаунт".
                                </li>
                            </ol>
                        </li>
                        <li>
                            <strong ref={ref_13}>ВІДМОВА ВІД ГАРАНТІЙ. ОБМЕЖЕННЯ ВІДПОВІДАЛЬНОСТІ</strong>
                            <ol>
                                <li>
                                    Dober докладає зусиль, щоб зробити роботу Месенджера безперебійною, але ми не можемо обіцяти, що ці зусилля призведуть до 100% результатів. Ви користуєтеся Месенджером на свій ризик і за своєю ініціативою. Ніщо в цих Умовах не створює додаткових гарантій щодо Месенджера, процесу та результатів його використання.
                                </li>
                                <li>
                                    Месенджер, усі матеріали, інформація, програмне забезпечення надаються "як є" і "як доступно" без будь-яких гарантій, явних або таких, що передбачаються, в максимальному ступені, допустимому відповідно до чинного законодавства.
                                </li>
                                <li>
                                    Dober відмовляється від усіх гарантій, явних та/або неявних, включаючи, від гарантії придатності для конкретної мети та досягнення конкретного результату.
                                </li>
                                <li>
                                    Dober не гарантує, що функції Месенджера будуть доступні, безперебійні або безпомилкові, що дефекти будуть виправлені, в тому числі, виправлені в конкретний термін. Dober не гарантує і не робить жодних заяв щодо використання або результатів використання Месенджера з точки зору їхньої правильності, точності, надійності, отримання конкретного ефекту, комерційного чи іншого результату, прибутку чи іншого.
                                </li>
                                <li>
                                    Dober не несе відповідальність за злом Облікового запису Користувача в разі, якщо Користувач вигадав слабкий пароль і Секретне питання-відповідь, оскільки при реєстрації Облікового запису Користувач дав згоду про розуміння важливості надійності пароля. 
                                </li>
                                <li>
                                    Dober не несе відповідальність за злом Облікового запису Користувача в разі, якщо Користувач вигадав слабкий пароль і Секретне питання-відповідь, оскільки при реєстрації Облікового запису Користувач дав згоду про розуміння важливості надійності пароля.
                                </li>
                                <li>
                                    <strong>Dober не несе відповідальності за:</strong>
                                    <ol>
                                        <li>
                                            будь-які збитки (ненавмисні, спеціальні, непрямі), втрати або шкоду, які не можна передбачити;
                                        </li>
                                        <li>
                                            упущену вигоду, втрату бізнесу, переривання бізнесу або втрату ділових можливостей (ці обмеження застосовуватимуться незалежно від того, чи був Dober попереджений про можливість такого збитку).
                                        </li>
                                        <li>
                                            За винятком видів відповідальності, які ми не можемо обмежити за законом, ми обмежуємо нашу відповідальність перед вами сумою, що дорівнює $100 USD.
                                        </li>
                                        <li>
                                            Користувачі погоджуються не притягувати та не намагатися притягнути Dober до відповідальності за будь-які технічні проблеми, збої та несправності Месенджера, збої ліній зв'язку, збої програмного забезпечення, проблеми з доступом до Месенджера, високу потребу в інтернет-трафіку, порушення безпеки та несанкціонованого доступу, а також інші подібні проблеми та дефекти, у тому числі за проблеми доступу з боку Користувача.
                                        </li>
                                        <li>
                                            Користувач погоджується, що Dober не нестиме жодної відповідальності в разі збою, пошкодження або знищення ваших комп'ютерних систем, даних або записів або будь-якої їхньої частини, а також за затримки, втрати, помилки або упущення в результаті збою.
                                        </li>
                                        <li>
                                            Dober не заявляє і не гарантує, що служба підтримки користувачів буде надавати миттєві відповіді на ваші запити. При цьому, ми підтверджуємо, що будемо намагатися робити все можливе, щоб усі запити були оброблені та адресовані.
                                        </li>
                                        <li>
                                            Ніщо в цих Умовах не створює для Dober будь-яких зобов'язань щодо створення, продовження будь-яких ділових чи інших відносин з Користувачами.
                                        </li>
                                    </ol>
                                </li>
                            </ol>
                        </li>
                        <li>
                            <strong ref={ref_14}>Зовнішні посилання</strong>
                            <ol>
                                <li>
                                    Месенджер не містить посилань і рекламу сторонніх додатків, веб-сайтів або ресурсів третіх осіб. Користувачі можуть передавати в чатах та/або Групах посилання на сторонні ресурси, Dober не несе відповідальності за будь-які дані, надіслані Користувачами в чатах і Групах, які розміщені за зовнішніми посиланнями. Дані, які передають Користувачі, в тому числі посилання на зовнішні ресурси третіх осіб, не перевірені і не схвалені Dober.
                                </li>
                                <li>
                                    Dober не має контролю над сторонніми веб-сайтами, іншими ресурсами і не несе відповідальність за їхню доступність, зміст або безпеку. Умови використання та Політика конфіденційності Dober не поширюються на ресурси третіх осіб, тому ми рекомендуємо Користувачам, під час переходу за посиланнями на сторонні ресурси, попередньо ознайомлюватися з умовами та політиками конфіденційності цих ресурсів. При відвідуванні зовнішніх ресурсів ви робите це на свій ризик і під свою відповідальність.
                                </li>
                            </ol>
                        </li>
                        <li>
                            <strong ref={ref_15}>ЗАСТОСОВНЕ ПРАВО, ЮРИСДИКЦІЯ</strong>
                            <ol>
                                <li>
                                    Умови використання діють відповідно до законодавства України. Будь-які спори, що випливають з Умов використання або пов'язані з ними, повинні розглядатися в судах України відповідної юрисдикції та територіальної підсудності.
                                </li>
                                <li>
                                Ви погоджуєтеся відшкодувати збиток і захистити Dober від будь-яких і всіх претензій, вимог, зобов'язань, втрат або витрат, включаючи розумні гонорари адвокатів, що виникли в результаті порушення вами цих Умов.
                                </li>
                                <li>
                                    Якщо у вас виникла суперечка з одним або кількома Користувачами Dober, ви звільняєте Dober від претензій, вимог, зобов'язань, витрат, видатків і шкоди, що виникають внаслідок таких суперечок або будь-яким чином пов'язані з ними.
                                </li>
                            </ol>
                        </li>
                        <li>
                            <strong ref={ref_16}>ПРАВО НА ВИКОРИСТАННЯ DOBER. ІНТЕЛЕКТУАЛЬНА ВЛАСНІСТЬ</strong>
                            <ol>
                                <li>
                                    Dober надає вам обмежену, відкличну, невиключну, таку, що не підлягає субліцензуванню та непередавану ліцензію на використання Месенджера.
                                </li>
                                <li>
                                    Месенджер, його окремі частини є об'єктом авторського права і захищені ним. Символи, логотипи або інші зображення, що належать Dober, захищені як зареєстровані або не зареєстровані торговельні марки, торгові найменування або знаки для товарів і послуг. Користувачі не мають права використовувати об'єкти інтелектуальної власності Dober без прямого дозволу Dober на це і не мають права передавати будь-які зі своїх прав або зобов'язань за нашими Умовами будь-кому іншому без нашої попередньої письмової згоди.
                                </li>
                                <li>
                                    Користувачі визнають, що всі права власності на Месенджер є і залишаються виключною власністю Dober та/або її ліцензіарів, включно з авторськими правами, товарними знаками (або будь-якими аналогічними знаками), доменами, логотипами, фірмовим стилем, комерційними секретами, патентами та іншими правами інтелектуальної власності. Ви не маєте жодних прав щодо цього Месенджера та його вмісту, окрім права доступу та використання відповідно до положень та умов, що містяться в цих Умовах використання та законодавстві України. Ви погоджуєтеся не порушувати авторські та інші права Dober.
                                </li>
                                <li>
                                    Ніщо, що міститься в Месенджері, не може тлумачитись як надання будь-якої ліцензії або права на використання будь-якого товарного знака без письмового дозволу Dober або будь-якої третьої сторони, яка може володіти товарними знаками.
                                </li>
                                <li>
                                    Відповідальність за повідомлення, файли та їхній зміст несе виключно Користувач, який їх надсилає. Dober не гарантує і не може гарантувати, що дані, які надають Користувачі, використовуючи Месенджер, не порушують прав третіх осіб і відповідають Умовам використання Dober. Якщо ви вважаєте, що Користувач Месенджера порушує ваші авторські права або права, що належать третім особам, зв'яжіться з нашою службою підтримки.
                                </li>
                            </ol>
                        </li>
                        <li>
                            <strong ref={ref_17}>Безпека та конфідейційність</strong>
                            <ol>
                                <li>
                                    <strong>Безпека</strong>. Користувачі гарантують, що після створення Облікового запису зберігатимуть свій пароль у таємниці та не повідомлятимуть його стороннім особам. У разі втрати доступу до Облікового запису, несанкціонованого використання вашого Облікового запису або будь-якого відомого або передбачуваного порушення безпеки, у тому числі втрати, крадіжки або розкриття вашого пароля, відновити доступ до вашого Облікового запису без активованої функції Секретне питання-відповідь буде неможливо. Будь ласка, уважно прочитайте про цю функцію та її важливість у нашій Політиці конфіденційності, оскільки якщо ви не створювали Секретне питання-відповідь, доступ до вашого Облікового запису буде втрачено безповоротно.
                                </li>
                                <li>
                                    <strong>Конфіденційність</strong>. Ми прагнемо захищати та зберігати конфіденційність ваших персональних даних, для цього ми впровадили відповідні правила та технічні заходи захисту даних, що перебувають під нашим контролем, від несанкціонованого доступу, неналежного використання або розкриття, зміни, знищення та втрати.
                                </li>
                                <li>
                                    БУДЬ ЛАСКА, ОЗНАЙОМТЕСЯ З ПОЛІТИКОЮ КОНФІДЕНЦІЙНОСТІ DOBER ЗА ПОСИЛАННЯМ, ЯКА ОПИСУЄ ПРАВИЛА, ЩО РЕГУЛЮЮТЬ, ЯКИМ ЧИНОМ DOBER ЗДІЙСНЮЄ ЗБІР, ЗБЕРІГАННЯ ТА ОБРОБКУ ПЕРСОНАЛЬНИХ ДАНИХ КОРИСТУВАЧІВ. DOBER ЗБИРАТИМЕ, ВИКОРИСТОВУВАТИМЕ ТА ПЕРЕДАВАТИМЕ ДАНІ ЛИШЕ ТИМИ СПОСОБАМИ, ЯКІ ОПИСАНІ В ЗАЗНАЧЕНІЙ ПОЛІТИЦІ КОНФІДЕНЦІЙНОСТІ.
                                </li>
                            </ol>
                        </li>
                        <li>
                            <strong ref={ref_18}>ПІДТРИМКА КОРИСТУВАЧІВ ПЛАТФОРМИ</strong>
                            <ol>
                                <li>
                                    Dober забезпечує підтримку Користувачів. Погоджуючись з Умовами використання, ви маєте право в будь-який час звернутися до служби підтримки Dober, надіславши електронного листа на адресу support@dober.chat.
                                </li>
                                <li>
                                    Після доставки вашого повідомлення служба підтримки розгляне його протягом 48-72 годин. Час відповіді служби підтримки залежить від складності вашого запиту і від того, наскільки чітко і конкретно він сформульований. Якщо на надання відповіді нам буде потрібно більше часу, ми постараємося повідомити вас про це. Служба підтримки має право не відповідати на ваш запит, якщо, на свій розсуд, вважає його некоректним, недостатнім, незрозуміло сформульованим тощо.
                                </li>
                                <li>
                                    Під час звернення до служби підтримки будьте чесні, надсилайте тільки правдиву інформацію, не грубіть, не використовуйте образливих слів, будьте ввічливі, доброзичливі.
                                </li>
                                <li>
                                    Також зверніть увагу, що ми не несемо відповідальність, якщо будь-хто з Користувачів або третіх осіб напише вам від імені Dober, щоб отримати від вас будь-яку інформацію, яку він/вона запитує. Будьте уважні та переконайтеся, що у вас є контакт із нашою службою підтримки.
                                </li>
                                <li>
                                    Якщо будь-яке положення цих Умов використання буде визнано письмовим рішенням недійсним або таким, що з будь-якої причини не має законної сили, то таке положення не вплине на дійсність і законну силу інших положень Умов використання.
                                </li>
                                <li>
                                    Незастосування Dober будь-яких прав або заходів щодо Користувачів у разі будь-якого порушення цих Умов використання не повинно розглядатися як відмова від таких прав або подальших дій у разі майбутніх порушень.
                                </li>
                                <li>
                                    Ви можете читати ці Умови використання різними мовами. У разі будь-яких розбіжностей під час перекладу та трактування положень Умов використання, переважне значення має текст, написаний українською мовою.
                                </li>
                            </ol>
                        </li>
                    </ol>
                </div>
            </div>
        </section>
    )
}