"use client"

import { useTranslation } from "react-i18next";
import { useRef } from "react";

import styles from "../assets/styles/info-pages.module.scss";
import Navigation from "../components/terms/Navigation";

export default function Terms() {

    const { t } = useTranslation();

    const blockRefs = useRef([]);

    const scrollToBlock = (blockIndex) => {
        const element = blockRefs.current[blockIndex];
        element.scrollIntoView({ behavior: "smooth" });
    };

    return (
        <section className="container">
            <div style={{padding: "0 30px"}}>
                <h2>{t("terms_page_title")}</h2>
                <div className={styles["introduction"]}>
                    <p>Діють з 1 квітня 2023 року.</p>
                    <p>
                        Ці Умови використання (далі - або Умови) регулюють використання вами Месенджера Dober та інших веб-ресурсів Dober, а також процес надання доступу до функціоналу Месенджера, що розроблений фізичною особою-підприємцем: Оберемок Д.П., код ЄДРПОУ: 3195118838 (далі "Dober", "ми", "наш", "нас")
                    </p>
                    <p>
                        Умови використання регулюються і тлумачаться відповідно до законодавства України та набувають чинності після реєстрації Користувача - створення ним Облікового запису в Месенджері.
                    </p>
                    <p>
                        Ці Умови визначають правила взаємодії між Dober і зареєстрованою особою, яка використовує Месенджер (далі "Користувач", "ви", "вас", "ваш").
                    </p>
                </div>
                <Navigation blockRefs={blockRefs} styles={styles} t={t}/>
                <div className={styles["list"]}>
                    <ol style={{padding: 0}}>
                        <li>
                            <strong>Що таке dober</strong>
                            <ol style={{padding: 0}}>
                                <li>
                                    <strong>Месенджер Dober</strong> - - безкоштовний мобільний додаток захищеного спілкування для Android та iOS, а також веб версія Месенджера. Месенджер дає змогу   Користувачам обмінюватися текстовими повідомленнями, надсилати відео та зображення в чатах і створювати Групи для спілкування необмеженої кількості Користувачів.   
                                </li>
                                <li>
                                    <strong>Переваги Dober :</strong>
                                    <ol>
                                        <li>Постквантове наскрізне шифрування даних, яке забезпечує їхню конфіденційність.</li>
                                        <li>Захищене централізоване зберігання даних.</li>
                                        <li>Захищений обмін файлами та повідомленнями в групах і чатах.</li>
                                        <li>Конфіденційність Користувачів і контроль Користувача над інформацією.</li>
                                        <li>Відсутність прив'язки Облікового запису Користувача до номера мобільного телефону або адреси електронної пошти.</li>
                                        <li>Можливість використання Сервера Бізнес-акаунта (конфіденційна інформація з Бізнес-акаунта не зберігається на пристроях Користувачів, втрата пристрою не призведе до втрати інформації)су Користувача до номера мобільного телефону або адреси електронної пошти.</li>
                                    </ol>
                                </li>
                            </ol>
                        </li>
                        <li>
                            <strong>Угода користувача</strong>
                            <ol>
                                <li>Будь ласка, уважно прочитайте ці Умови та Політикою конфіденційності Dober до початку користування Месенджером, після чого позначте свою згоду з ними у спливаючому вікні на екрані вашого девайса (pop-up). Якщо ви не позначите свою згоду дотримуватися Умов використання та Політики конфіденційності, ви не зможете отримати доступ до Месенджера. </li>
                                <li><strong>Dober</strong> намагається постійно покращувати та розширювати функціонал Месенджера, крім того, ми стежимо за дотриманням чинного законодавства, тому час від часу ми можемо вносити зміни до Умов використання Dober. Зміни цих Умов набувають чинності з моменту опублікування оновленої версії. При внесенні змін до Умов ми оновимо дату, з моменту якої оновлені Умови використання вступили в дію, у верхній частині наших Умов. </li>
                                <li>
                                    Користувач погоджується і визнає, що Dober може переглянути Умови використання або будь-яку їх частину. Оновлені Умови використання будуть розміщені в загальнодоступній формі в Месенджері або повідомлення про зміну Умов будуть відображені при первинному відкритті Месенджера після такого оновлення. Використання Месенджера після такого повідомлення означає прийняття Користувачем змінених Умов використання. Версія Умов використання, що відображається в даний момент у Месенджері, має пріоритет над усіма попередніми версіями.
                                </li>
                                <li>
                                    Якщо ви не згодні з Умовами, будь-якими змінами до них, ви можете припинити використання Dober, видалити Обліковий запис і Месенджер Dober зі своїх девайсів.
                                </li>
                                <li>
                                    Користувач не може вважати Dober відповідальним за шкоду, яка може виникнути внаслідок використання Месенджера. 
                                </li>
                                <li>
                                    Користувач зобов'язується самостійно оцінювати правомірність використання Месенджера відповідно до чинного законодавства країни, резидентом якої він є. Ми не робимо заяв про те, що Месенджер доступний для використання або дозволений законом у будь-якому конкретному місці. Якщо ви використовуєте Месенджер, ви робите це за власною ініціативою і несете відповідальність за дотримання застосовних місцевих законів.
                                </li>
                                <li>
                                    Користувач дає згоду на отримання сповіщень та повідомлень Месенджера. Така згода діятиме на постійній основі доти, доки Користувач не відкличе її, застосувавши відповідні налаштування свого девайса.
                                </li>
                            </ol>
                        </li>
                        <li>
                            <strong>Вікове обмеження</strong>
                            <ol>
                                <li>
                                    Месенджер не призначений для використання особами віком до 16 років. Якщо вам ще немає 16 років, просимо не використовувати Месенджер Dober до досягнення цього віку.
                                </li>
                                <li>
                                    Якщо вам стало відомо, що особа віком до 16 років використовує Dober, повідомте нам про це, будь ласка, за адресою support@dober.chat, щоб ми могли вирішити цю ситуацію оперативно.
                                </li>
                            </ol>
                        </li>
                        <li>
                            <strong>Правила користування Месенджером</strong>
                            <ol>
                                <li>
                                    Ви можете використовувати Месенджер тільки в законних цілях і відповідно до цих Умов. Користувачам заборонено зберігати, поширювати або передавати будь-які незаконні матеріали через Месенджер. Використання Месенджера в незаконних цілях може потягнути за собою кримінальну або цивільну відповідальність, видалення або призупинення дії вашого Облікового запису.
                                </li>
                                <li>
                                    Користувач гарантує, що :
                                    <ol>
                                        <li>
                                            є фізичною дієздатною особою не молодше 16 років;
                                        </li>
                                        <li>
                                            не перешкоджатиме або не заборонятиме іншим Користувачам використовувати Месенджер, включно із застосуванням засобів "злому" або псування Месенджера;
                                        </li>
                                        <li>
                                            не намагатиметься видати себе за іншого Користувача або використовувати нікнейм іншого Користувача;
                                        </li>
                                        <li>
                                            не використовуватиме Месенджер у будь-яких незаконних цілях і будь-яким способом, не дозволеним цими Умовами та Політикою конфіденційності;
                                        </li>
                                        <li>
                                            не збиратиме та/або не зберігатиме інформацію про Користувачів Месенджера;
                                        </li>
                                        <li>
                                            не використовуватиме будь-який пристрій або процес для втручання у функції Месенджера, пов'язані з безпекою, включно з функціями, що запобігають або обмежують використання чи копіювання будь-якого контенту або вводять обмеження на використання Месенджера;
                                        </li>
                                        <li>
                                            не передаватиме через Месенджер будь-яке програмне забезпечення або інші матеріали, що містять вірус або інший шкідливий чи руйнівний компонент;
                                        </li>
                                        <li>
                                            не використовуватиме Месенджер як засіб для злочинної змови або схеми, які є незаконними або шкідливими;
                                        </li>
                                        <li>
                                            не буде продавати, в інший спосіб передавати або субліцензувати Месенджер;
                                        </li>
                                        <li>
                                            не буде продавати, в інший спосіб передавати або субліцензувати Месенджер;
                                        </li>
                                        <li>
                                            не порушуватиме чинне законодавство, включно із законами про конфіденційність третіх осіб та їхні права інтелектуальної власності;
                                        </li>
                                        <li>
                                            не буде створювати і множити неправдиві Облікові записи, що вводять в оману;
                                        </li>
                                        <li>
                                            не використовуватиме будь-які автоматизовані засоби або інтерфейси для вилучення даних інших Користувачів.
                                        </li>
                                    </ol>
                                </li>
                            </ol>
                        </li>
                    </ol>
                </div>
            </div>
        </section>
    )
}