
export default function Navigation({styles, blockRefs, scrollToRef}) {

    const titles = [
        "ЩО ТАКЕ DOBER",
        "УГОДА КОРИСТУВАЧА",
        "ВІКОВЕ ОБМЕЖЕННЯ",
        "ПРАВИЛА КОРИСТУВАННЯ МЕСЕНДЖЕРОМ",
        "ПОРУШЕННЯ УМОВ ВИКОРИСТАННЯ",
        "РЕЄСТРАЦІЯ",
        "СЕКРЕТНЕ ЗАПИТАННЯ-ВІДПОВІДЬ І ПІН-КОД",
        "ПІДПИСКА ТА ОПЛАТА",
        "СТВОРЕННЯ ЧАТІВ І ГРУП",
        "БЛОКУВАННЯ КОРИСТУВАЧІВ",
        "НАЛАШТУВАННЯ ОБЛІКОВОГО ЗАПИСУ",
        "ВИДАЛЕННЯ ОБЛІКОВОГО ЗАПИСУ",
        "ВІДМОВА ВІД ГАРАНТІЙ. ОБМЕЖЕННЯ ВІДПОВІДАЛЬНОСТІ",
        "ЗОВНІШНІ ПОСИЛАННЯ",
        "ЗАСТОСОВНЕ ПРАВО, ЮРИСДИКЦІЯ",
        "ПРАВО НА ВИКОРИСТАННЯ DOBER. ІНТЕЛЕКТУАЛЬНА ВЛАСНІСТЬ",
        "БЕЗПЕКА ТА КОНФІДЕНЦІЙНІСТЬ",
        "ПІДТРИМКА КОРИСТУВАЧІВ ПЛАТФОРМИ",
    ]

    return(
        <div className={styles["navigation"]}>
            <ol>
                {titles.map((title, key) => 
                    <li key={key} onClick={scrollToRef(blockRefs.current[key])}> {title}</li>
                )}
            </ol>
        </div>
    )
}