"use client"

import { useTranslation } from "react-i18next";
import { useRef, useEffect } from "react";
import Link from "next/link";

import styles from "../assets/styles/info-pages.module.scss";

export default function PrivacyPolity() {

    const ref_1 = useRef(null);
    const ref_2 = useRef(null);
    const ref_3 = useRef(null);
    const ref_4 = useRef(null);
    const ref_5 = useRef(null);
    const ref_6 = useRef(null);
    const ref_7 = useRef(null);
    const ref_8 = useRef(null);
    const ref_9 = useRef(null);
    const ref_10 = useRef(null);
    const ref_11 = useRef(null);
    const ref_12 = useRef(null);
    const ref_13 = useRef(null);
    const ref_14 = useRef(null);
    const ref_15 = useRef(null);
    const ref_16 = useRef(null);

    const scrollToHeader = (ref) => {
        if (ref.current) {
        ref.current.scrollIntoView({ behavior: 'smooth' });
        }
    };


    return (
        <section className="container">
            <div style={{padding: "0 30px"}}>
                <h2>Політика конфіденційності dober</h2>
                <div className={styles["introduction"]}>
                    <p>
                        Взаємодіючи з веб-сайтом https://dober.chat або використовуючи Месенджер Dober, через його мобільну версію - мобільний застосунок Dober, ви погоджуєтесь з Політикою конфіденційності та надаєте згоду на збирання, оброблення, зберігання та передачу Персональних даних.
                    </p>
                    <p>
                        Політика конфіденційності ("Політика") описує правила та принципи збору та обробки Персональних даних Користувачів. Dober є Процесором і у випадках, описаних у цій Політиці, може виступати Контролером даних згідно з GDPR. Месенджер Dober розроблено фізичною особою-підприємцем Оберемок Д.П., код ЄДРПОУ: 3195118838.
                    </p>
                    <p>
                        Відсилання на слова "ми", "наш" або "нас" "Месенджер" або аналогічні слова за змістом означають "Dober" - месенджер захищеного спілкування.
                    </p>
                    <p>
                        Відсилання на слова "ви", "вас" або "ваш" або аналогічні слова за змістом означають "Користувачів" Dober.
                    </p>
                    <p>
                        Ми прагнемо до захисту конфіденційності та створення заходів безпеки Персональних даних, які ви нам надаєте, мінімізації збору ваших даних. Dober збиратиме, використовуватиме і передаватиме дані тільки тими способами, які описані в цій Політиці.
                    </p>
                    <p>
                        ЦЯ ПОЛІТИКА ОПИСУЄ ПРАВИЛА, ЯКІ РЕГУЛЮЮТЬ, ЯКИМ ЧИНОМ DOBER ЗДІЙСНЮЄ ЗБІР, ЗБЕРІГАННЯ ТА ОБРОБКУ ПЕРСОНАЛЬНИХ ДАНИХ КОРИСТУВАЧІВ ОСОБИСТИХ АКАУНТІВ DOBER, ДАНІ ЯКИХ ЗБЕРІГАЮТЬСЯ НА ПУБЛІЧНОМУ СЕРВЕРІ DOBER.
                    </p>
                </div>
                <ol className={styles["navigation"]}>
                    <li onClick={() => scrollToHeader(ref_1)}>ТЕРМІНИ </li>
                    <li onClick={() => scrollToHeader(ref_2)}>ПЕРСОНАЛЬНІ ДАНІ, ЯКІ МИ ЗБИРАЄМО ТА ЗБЕРІГАЄМО</li>
                    <li onClick={() => scrollToHeader(ref_3)}>СПОСОБИ ТА ПІДСТАВИ ЗБОРУ ПЕРСОНАЛЬНИХ ДАНИХ</li>
                    <li onClick={() => scrollToHeader(ref_4)}>ЦІЛІ ВИКОРИСТАННЯ ПЕРСОНАЛЬНИХ ДАНИХ</li>
                    <li onClick={() => scrollToHeader(ref_5)}>ВІКОВЕ ОБМЕЖЕННЯ КОРИСТУВАЧІВ DOBER</li>
                    <li onClick={() => scrollToHeader(ref_6)}>ВІКОВЕ ОБМЕЖЕННЯ КОРИСТУВАЧІВ DOBER</li>
                    <li onClick={() => scrollToHeader(ref_7)}>ПРАВА КОРИСТУВАЧІВ</li>
                    <li onClick={() => scrollToHeader(ref_8)}>ТЕРМІНИ ЗБЕРІГАННЯ ПЕРСОНАЛЬНИХ ДАНИХ</li>
                    <li onClick={() => scrollToHeader(ref_9)}>БЕЗПЕКА ЗБЕРІГАННЯ ДАНИХ</li>
                    <li onClick={() => scrollToHeader(ref_10)}>МІЖНАРОДНА ПЕРЕДАЧА ПЕРСОНАЛЬНИХ ДАНИХ</li>
                    <li onClick={() => scrollToHeader(ref_11)}>ДОДАТКОВЕ ПОВІДОМЛЕННЯ ПРО КОНФІДЕНЦІЙНІСТЬ ДЛЯ ЖИТЕЛІВ КАЛІФОРНІЇ</li>
                    <li onClick={() => scrollToHeader(ref_12)}>РОЗСИЛКА ТА РЕКЛАМНІ ПРОПОЗИЦІЇ</li>
                    <li onClick={() => scrollToHeader(ref_13)}>ПОСИЛАННЯ НА ІНШІ САЙТИ</li>
                    <li onClick={() => scrollToHeader(ref_14)}>ВИКОРИСТАННЯ ФАЙЛІВ COOKIE</li>
                    <li onClick={() => scrollToHeader(ref_15)}>ЗВОРОТНІЙ ЗВ'ЯЗОК</li>
                    <li onClick={() => scrollToHeader(ref_16)}>ЗМІНИ В ЦІЙ ПОЛІТИЦІ</li>
                </ol>
                <div className={styles["list"]}>
                    <ol style={{padding: 0}}>
                        <li>
                            <strong ref={ref_1}>ТЕРМІНИ</strong>
                            <ol>
                                <li>
                                    <strong>Персональні дані</strong> - інформація, яка ідентифікує вас як конкретну особу або може ідентифікувати для взаємодії з вами.
                                </li>
                                <li>
                                    <strong>Користувач</strong> - ідентифікована та не ідентифікована фізична особа, яка взаємодіє з Месенджером.
                                </li>
                                <li>
                                    <strong>CCPA</strong> <Link href="https://leginfo.legislature.ca.gov/faces/billTextClient.xhtml?bill_id=201720180SB1121" target="blank">(California Consumer Privacy Act)</Link> - статут штату Каліфорнії, призначений забезпечити права на конфіденційність і захист прав споживачів для мешканців Каліфорнії та США.
                                </li>
                                <li>
                                    <strong>Cookie</strong> - невеликі текстові файли, в яких зберігається інформація про ваші попередні дії на веб-сайті Dober. 
                                </li>
                                <li>
                                    <strong>GDPR</strong> - Загальний Регламент про захист даних ("GDPR"), який застосовується для регулювання обробки персональних даних з 25 травня 2018 року.
                                </li>
                                <li>
                                    <strong>Бізнес акаунт</strong> - обліковий запис Користувача (Бізнес-клієнта), який отримує можливість використовувати Месенджер як закритий канал комунікації, доступний тільки співробітникам такого Бізнес-клієнта або авторизованим користувачам, доступ до яких дозволено тільки Бізнес-клієнтом.
                                </li>
                                <li>
                                    <strong>Особистий акаунт</strong> - обліковий запис зареєстрованого Користувача Dober.
                                </li>
                                <li>
                                    <strong>Сервер Бізнес-акаунта</strong> - це придбаний або орендований власником Бізнес-акаунта (Бізнес-клієнтом) фізичний або хмарний сервер, на якому буде розгорнуто програмне забезпечення Dober, зберігатиметься вся інформація власника Бізнес-акаунта (Бізнес-клієнта). 
                                </li>
                                <li>
                                    <strong>Публічний сервер</strong> - орендований або придбаний Dober фізичний або хмарний сервер, на якому зберігаються всі дані Особистих акаунтів і програмне забезпечення Dober.
                                </li>
                            </ol>
                        </li>
                        <li>
                            <strong ref={ref_2}>ПЕРСОНАЛЬНІ ДАНІ, ЯКІ МИ ЗБИРАЄМО І ЗБЕРІГАЄМО</strong>
                            <p>У Dober доступні опції Бізнес акаунта та Особистого акаунта в Месенджері. Детальніше про це ви можете прочитати в Умовах використання Dober.</p>
                            <ol>
                                <li>
                                    <strong>Персональні дані, що збираються добровільно за ініціативою Користувачів. Коли Користувач створює Особистий акаунт для використання Месенджера</strong>: Ми збираємо Персональні дані, які ідентифікують вас як конкретну особу, необхідні для створення та ведення облікового запису Користувача (облікового запису або акаунту), передавання інформації всередині Месенджера у зв'язку з використанням Месенджера. Персональні дані Користувачів включають в себе:
                                    <ol>
                                        <li>
                                            <strong>Логін, ім'я облікового запису та нікнейм</strong>. Для реєстрації облікового запису вам необхідно створити логін - унікальне ім'я вашого облікового запису, яке ви будете вводити під час кожного входу в обліковий запис на будь-якому пристрої, для ідентифікації Користувача. Не передавайте та не розкривайте логін третім особам, щоб запобігти можливості злому вашого облікового запису. Ви можете додавати ім'я (ім'я, під яким інші Користувачі будуть бачити вас в адресній книзі Месенджера, ім'я Користувача не є унікальним і може збігатися з іменами інших Користувачів) і нікнейм (унікальний ідентифікатор, за яким інші Користувачі зможуть знайти вас у базі даних Месенджера). Зверніть увагу, що ім'я та нікнейм будуть загальнодоступні для інших Користувачів. Dober не вимагає, щоб ваше ім'я та/або нікнейм відповідали вашому фактичному імені. Ім'я та нікнейм можуть бути вигаданими та обрані на ваш розсуд.
                                        </li>
                                        <li>
                                            <strong>Пароль і пін код</strong>. Для реєстрації облікового запису Користувач має створити пароль, який забезпечуватиме вхід до облікового запису на будь-якому пристрої Користувача, та пін код, який забезпечує захист від відкриття Месенджера іншими користувачами пристрою, при цьому у Мессенджера відсутня інтеграція з механізмами безпеки Android та iOS. Dober обробляє паролі, але не зберігає їх. Зберігання хешу паролів також не здійснюється, завдяки цьому зворотна інженерія пароля Користувача неможлива. При створенні пароля пам'ятайте, що чим складніший пароль, тим сильнішим буде криптографічний захист листування в Dober. Dober не обробляє і не зберігає пін-код Користувача.
                                        </li>
                                        <li>
                                            <strong>Секретне запитання-відповідь</strong>. Підчас реєстрації облікового запису Користувач може заповнити додаткову інформацію для відновлення доступу до облікового запису в разі втрати пароля. Якщо Користувач не створює інформацію для відновлення пароля, при його втраті обліковий запис більше не буде доступний без можливості його відновлення. Не розголошуйте відповіді на запитання для відновлення пароля третім особам, щоб запобігти можливості зламу вашого облікового запису.
                                        </li>
                                        <li>
                                            <strong>Відкритий ключ</strong>. Кожен Користувач має свій відкритий і закритий ключ. Відкритий ключ - це одна з двох частин пари ключів, які використовуються в криптографії з відкритим ключем, також відомий як наскрізне шифрування і використовується для шифрування повідомлення або даних. Dober зберігає і обробляє відкритий ключ. Закритий ключ, навпаки, зберігається в таємниці і використовується тільки власником для розшифровки повідомлень, зашифрованих наскрізним шифруванням. При використанні наскрізного шифрування відкритий ключ шифрує дані, а закритий ключ дешифрує їх. Під час передачі повідомлення через Месенджер відправник генерує симетричний ключ SHA3-512, який використовується для шифрування повідомлення відкритим ключем, що зберігається на Публічному сервері або Сервері Бізнес-акаунта. Одержувач повідомлення розшифровує симетричний ключ за допомогою закритого ключа, який розшифровується за допомогою пароля. Для кожного повідомлення Dober генерує унікальний симетричний ключ. Генерація унікального симетричного ключа для кожного повідомлення забезпечує датковий рівень безпеки в процесі передавання даних.
                                        </li>
                                        <li>
                                            <strong>Зображення профілю</strong>. Для індивідуалізації вашого облікового запису ви можете додавати зображення профілю. Dober не вимагає, щоб зображення профілю відповідало вашій фактичній зовнішності та було вашим персональним фото. Зверніть увагу, що зображення профілю завжди є загальнодоступним для інших Користувачів і зберігається на Публічному сервері та Сервері Бізнес акаунта в незашифрованому вигляді.
                                        </li>
                                        <li>
                                            <strong>Аудіо, відео, документи та повідомлення</strong>. Ми зберігаємо повідомлення, фотографії, відео та документи, які ви завантажуєте у ваші хмарні чати в Dober, щоб ви могли отримувати доступ до своїх даних на ваших пристроях у будь-який час, не покладаючись на сторонні резервні копії. Дані зберігаються в зашифрованому вигляді та доступні тільки відправнику й одержувачу.
                                        </li>
                                        <li>
                                            <strong> Метадані.</strong> Dober може отримувати і зберігати дані, що виникають в результаті використання вами функцій: вхід, листування, дзвінок, відеозапис, фото, а також дата і час вашого дзвінка в Dober для підвищення безпеки вашого облікового запису, а також для запобігання спаму, зловживанням та іншим порушенням наших Умов використання.
                                        </li>
                                    </ol>
                                </li>
                                <li>
                                    <strong>Персональні дані, що збираються автоматично</strong>. При взаємодії з Месенджером деяка інформація про Користувачів автоматично збирається з комп'ютера або мобільного пристрою.
                                    <ol>
                                        <li>
                                            <strong>Логи сервера</strong>. Наші Публічні сервери автоматично збирають дані, коли ви використовуєте Месенджер і записують їх. Dober може збирати Персональні дані, такі як: IP-адресу, для розуміння країни, з якої ви підключаєтесь під час використання Месенджера, налаштування часового поясу, інформацію про пристрій і тип браузера, які ви використовуєте для доступу до Месенджера, URL-адресу веб-сайту, з якого ви відвідали Месенджер, сторонні сайти, на які ви переходите для виходу з Месенджера, а також ваші мовні налаштування.
                                        </li>
                                        <li>
                                            <strong>Дані про пристрій</strong>. Dober збирає дані про пристрої, на яких використовується Месенджер, такі як: тип пристрою, встановлена операційна система, налаштування пристрою, ідентифікатори додатків і дані про збої. Дані про пристрій зберігаються на Публічному сервері в зашифрованому вигляді і доступні тільки Користувачу - власнику логіна і пароля.
                                        </li>
                                        <li>
                                            <strong>Дані про місцезнаходження</strong>. Ми отримуємо від Користувачів дані, які допомагають приблизно визначати ваше місце розташування (місце розташування пристрою, з якого Користувач під'єднується до Месенджера). Наприклад, Dober може визначати ваше приблизне місцерозташування з метою сприяння локалізації. Дані про місцезнаходження зберігаються на Публічному сервері в зашифрованому вигляді і доступні тільки Користувачеві - власнику логіна і пароля. Dober не відстежує Користувачів за їх GPS.
                                        </li>
                                        <li>
                                            <strong>Дані про час і дату</strong>. Dober збирає дані про дату та час створення облікового запису, а також дату та час останнього входу до Месенджера, для надання Користувачем інформації про сесії, яка захищає та контролює обліковий запис від несанкціонованих входів.езнаходження. 
                                        </li>
                                        <li>
                                            Месенджер передбачає можливість створення Бізнес акаунта, доступ до якого надає власник такого Бізнес акаунта (Бізнес-клієнт), надає іншим Користувачам. Крім того, власник Бізнес акаунта може використовувати власний Сервер Бізнес акаунта для зберігання, обробки Персональних даних Користувачів Бізнес акаунта, які отримали до нього доступ.
                                        </li>
                                        <li>
                                            Коли Користувач створює Бізнес акаунта в Месенджері: Ми не збираємо дані Бізнес Користувача (Бізнес-клієнта), який використовує Месенджер як закритий канал комунікації, доступний тільки Користувачам Бізнес акаунта, яким Бізнес-клієнт надав доступ до такого Бізнес акаунта. Бізнес-клієнт використовує свій Сервер Бізнес акаунта для зберігання, обробки персональних даних Користувачів, яким він надає доступ до нього. <br />
                                            Дані про Сервер Бізнес акаунта. При створенні Бізнес акаунта, Користувач передає Dober адресу Сервера Бізнес акаунта, а також інші дані, зазначені в п.п. 2.1.1. - 2.1.7. Політики, як при створенні Особистого акаунта.
                                        </li>
                                        <li>
                                            <strong>Dober</strong> не збирає і не зберігає дані Користувачів Бізнес акаунта. Такі Користувачі отримують доступ до Месенджера від власника Бізнес акаунта (Бізнес-клієнта), який, своєю чергою, здійснює збирання, зберігання та обробку персональних даних таких Користувачів на Сервері Бізнес акаунта.
                                        </li>
                                        <li>
                                            <strong>Dober</strong> не використовує телефонні номери як ідентифікатори для створення й авторизації облікового запису, а також для входу в обліковий запис за допомогою надсилання SMS із кодом.
                                        </li>
                                        <li>
                                            <strong>Dober</strong> не використовує і не запитує електронну пошту Користувачів для створення та авторизації облікового запису і відновлення пароля.
                                        </li>
                                        <li>
                                            <strong>Dober</strong> не здійснює інтеграцію з телефонною книгою пристрою Користувача, на якому він використовує Месенджер. При цьому, Користувач завжди має доступ до інформації про пристрій, з якого він використовував Месенджер і може завершити сесію.
                                        </li>
                                        <li>
                                            <strong>Dober</strong> не збирає і не обробляє чутливі категорії Персональних даних Користувачів (чутливі дані), як відомості про расу, етнічну приналежність, релігійні та/або філософські переконання, сексуальне життя й орієнтацію, політичні погляди, членство в профспілках, інформацію про здоров'я, а також генетичні та біометричні дані. Ми також не збираємо інформацію про судимості та правопорушення Користувачів. Ми не збираємо ваші фінансові дані, дані платіжних карт, фінансових транзакцій тощо.
                                        </li>
                                    </ol>
                                </li>
                            </ol>
                        </li>
                        <li>
                            <strong ref={ref_3}>СПОСОБИ ТА ПІДСТАВИ ЗБОРУ ПЕРСОНАЛЬНИХ ДАНИХ</strong>
                            <ol>
                                <li>
                                    Dober збирає та обробляє Персональні дані Користувачів для надання доступу до Месенджера та забезпечення його використання, виконання зобов'язань, покладених законами, дотримання вимог державних органів, зокрема контролюючих і правоохоронних органів, для врегулювання та запобігання розбіжностям і суперечкам, виявлення й запобігання шахрайству або іншим незаконним діям з даними, а також для захисту інтересів, прав і свобод Користувачів, пов'язаних із захистом їхніх Персональних даних.
                                </li>
                                <li>
                                    Ми збираємо ідентифіковані та неідентифіковані Персональні дані Користувачів під час реєстрації облікового запису Користувачем і використання ним Месенджера.
                                </li>
                            </ol>
                        </li>
                        <li>
                            <strong ref={ref_4}>ЦІЛІ ВИКОРИСТАННЯ ПЕРСОНАЛЬНИХ ДАНИХ</strong>
                            <ol>
                                <li>
                                    Ми обробляємо Персональні дані Користувачів для цілей, які викладені в Політиці:
                                    <ol>
                                        <li>
                                            Для надання Користувачу інформації про його використання Dober (дані сесії - історія та час відвідування, активні сесії, дані пристрою, з якого Користувач заходив у Месенджер);
                                        </li>
                                        <li>
                                            Для надання Користувачу можливості керувати пристроями, яким доступний обліковий запис, та для відстеження несанкціонованих доступів пристроїв третіх осіб до облікового запису Користувача;
                                        </li>
                                        <li>
                                            Для забезпечення внутрішнього контролю якості та безпеки, захисту від шахрайських або незаконних дій та притягнення до відповідальності осіб, відповідальних за такі дії;
                                        </li>
                                        <li>
                                            Для забезпечення дотримання закону, зокрема захисту наших прав, прав Користувачів або прав третіх осіб;
                                        </li>
                                        <li>
                                            Для запобігання або припинення діяльності, яку ми можемо вважати незаконною, неетичною;
                                        </li>
                                        <li>
                                            Для підвищення безпеки вашого облікового запису, а також для запобігання спаму, зловживань та інших порушень;
                                        </li>
                                        <li>
                                            Для надання відповідей на запити та скарги, а також комунікації з Користувачами;
                                        </li>
                                        <li>
                                            Для розробки та надання інструментів пошуку, а також додаткових можливостей у Месенджері.
                                        </li>
                                    </ol>
                                </li>
                            </ol>
                        </li>
                        <li>
                            <strong ref={ref_5}>ВІКОВЕ ОБМЕЖЕННЯ КОРИСТУВАЧІВ</strong>
                            <ol>
                                <li>
                                    Месенджер не призначений для використання неповнолітніми віком до 16 років. Dober свідомо не збирає інформацію про неповнолітніх у віці до 16 років і вважає, що діти будь-якого віку повинні отримувати згоду батьків або законних представників перед використанням Месенджера і наданням будь-яких Персональних даних. 
                                </li>
                                <li>
                                    Якщо ви вважаєте, що ми помилково або ненавмисно зібрали Персональні дані неповнолітніх віком до 16 років, повідомте нам про це за адресою support@dober.chat, щоб ми могли видалити ці дані.
                                </li>
                            </ol>
                        </li>
                        <li>
                            <strong ref={ref_6}>РОЗКРИТТЯ ПЕРСОНАЛЬНИХ ДАНИХ</strong>
                            <ol>
                                <li>
                                    Dober може передавати та розкривати Персональні дані Користувачів для реалізації та захисту своїх прав і прав Користувачів, забезпечення безпеки Dober, запобігання шахрайству та незаконній діяльності або в разі загрози безпеці, зокрема, для запобігання смерті або безпосередній шкоді здоров'ю.
                                </li>
                                <li>
                                    Dober може передавати і розкривати Персональні дані Користувачів правоохоронним і регулюючим органам за їх законним запитом. Якщо ми отримаємо запит на надання Персональних даних, ми можемо розкривати такі дані в разі, якщо таке розкриття відповідає застосовному праву, нормативним актам або судовим наказам або є обов'язковим згідно з ними.
                                </li>
                                <li>
                                    Dober може передавати і розкривати Персональні дані Користувачів відповідно до положень про конфіденційність, викладених в цій Політиці, у разі зміни господарської структури Dober, такої як: злиття, поглинання, процедура банкрутства, ліквідація, реорганізація, продаж частини або всіх активів або акцій Dober, залучення інвестицій, відкрита емісія цінних паперів, придбання всього бізнесу або його частини, у схожих операціях і процедурах. При цьому, ми зобов'язуємося забезпечити рівень безпеки та захисту ваших даних на рівні, не нижчому за той, що описаний у цій Політиці.
                                </li>
                                <li>
                                    Користувач самостійно визначає обсяг та кількість Персональних даних, які він передає іншим Користувачам у момент використання Месенджера. Dober не контролює і не несе відповідальність за обробку та зберігання Персональних даних, які Користувачі надали третім особам. Dober не може видалити всі копії інформації про Користувача, які раніше були передані третім особам. Наприклад, коли ви ділитеся файлами з Користувачами в хмарних чатах, Dober не несе відповідальність за поширення ваших Персональних даних такими Користувачем і не може вплинути на використання ваших даних третіми особами.
                                </li>
                                <li>
                                    Dober не несе відповідальності за порушення прав Користувачів або прав третіх осіб, якщо таке порушення сталося внаслідок надсилання будь-якої інформації в чатах та/або групових чатах.
                                </li>
                            </ol>
                        </li>
                        <li>
                            <strong ref={ref_7}>ПРАВА КОРИСТУВАЧІВ</strong>
                            <ol>
                                <li>
                                    <strong>Право на доступ</strong>. У Політиці Конфіденційності перераховані Персональні дані Користувачів, які збирає та обробляє Dober. Користувач може отримати підтвердження про використання та обробку Персональних даних, а також зв'язатися з DPO для того, щоб запитати доступ до Персональних даних, які ми збираємо та зберігаємо, згідно зі ст. 15 Загального регламенту щодо захисту даних.
                                </li>
                                <li>
                                    <strong>Право на виправлення</strong>. Якщо Персональні дані, які зберігає та обробляє Dober, є неточними або неповними, Користувач має право оновлювати, виправляти, доповнювати свої Персональні дані. Користувач може самостійно внести виправлення, увійшовши до свого акаунта Dober з інтерфейсу мобільного додатку або веб-версії Dober і скористатися функцією "видалити", некоректні дані будуть видалені та Користувач зможе внести оновлення. Користувач також може звернутися до DPO, щоб отримати доступ до своїх Персональних даних для їхнього оновлення, виправлення та/або зміни, згідно зі ст. 16 Загального регламенту щодо захисту даних. Ми проінформуємо вас про вжиті заходи протягом 30 робочих днів з дня такого запиту.
                                </li>
                                <li>
                                    <strong>Право на експорт</strong>. Користувач може попросити про перенесення Персональних даних стороннім організаціям, згідно зі ст. 20 Загального регламенту щодо захисту даних. Ви маєте право отримати Персональні дані в структурованому, загально використовуваному і машинозчитуваному форматі і використовувати їх в іншому місці або попросити нас передати їх третій стороні за вашим вибором. Дане право Користувач може реалізувати через інтерфейс свого акаунта Dober.
                                </li>
                                <li>
                                    <strong>Право на видалення</strong>.Користувач має право видалити Персональні дані про себе згідно зі ст. 17 Загального регламенту щодо захисту даних. Користувач може зробити це самостійно, скориставшись відповідною опцією в Месенджері або ж звернутися до нас, надіславши запит на електронну пошту support@dober.chat. Персональні дані, в такому випадку, будуть видалені назавжди. У разі запиту на видалення, Dober проінформує вас про вжиті заходи протягом 30 робочих днів з дня такого запиту.
                                </li>
                                <li>
                                    <strong>Право на обмеження обробки</strong>. Ви можете попросити нас припинити або призупинити обробку Персональних даних. У разі запиту на обмеження обробки, ми проінформуємо Користувача протягом 30 робочих днів з дня такого запиту. Якщо ви вимагаєте обмежити обробку Персональних даних після того, як ми поділилися ними з третіми особами відповідно до цієї Політики, у можливих випадках ми повідомимо їх про таке обмеження.
                                </li>
                                <li>
                                    <strong>Право на заперечення.</strong> Користувач має право в будь-який момент заявити заперечення проти обробки Персональних даних, згідно зі ст. 21 Загального регламенту щодо захисту даних.
                                </li>
                                <li>
                                    <strong>Право на відкликання згоди на обробку даних</strong>. Користувач має право в будь-який момент відкликати свою згоду на обробку Персональних даних, яка була надана Dober. Ми покладаємося на вашу згоду як на юридичну підставу для обробки даних, у разі відкликання Користувачем згоди на обробку, деякі функції Месенджера можуть бути недоступні.
                                </li>
                                <li>
                                    <strong>Право не піддаватися автоматизованому ухваленню рішень в індивідуальних випадках, у тому числі профілювання</strong>. Користувач має право не піддаватися рішенню, яке ґрунтується винятково на автоматизованій обробці, зокрема, профілюванні, що спричиняє його юридичні наслідки, згідно зі ст. 22 Загального регламенту щодо захисту даних.
                                </li>
                                <li>
                                    <strong>Право подати скаргу до наглядового органу</strong>. Якщо у Вас є сумніви з приводу будь-якого аспекту Політики конфіденційності Dober, зокрема, способу обробки Ваших персональних даних, Ви можете повідомити про це до відповідного наглядового органу або звернутися до DPO електронною поштою чи через форму для запитів.
                                </li>
                                <li>
                                    <strong>Dober</strong> може відмовити Користувачам у праві на доступ, виправлення, перенесення, видалення, заперечення, якщо Dober виступає в ролі процесора Персональних даних і обмежена в повноваженнях контролером даних. У разі відмови у праві на доступ, виправлення, перенесення, забуття, заперечення Персональних даних, ми зобов'язані проінформувати вас про причини, протягом 30 (тридцяти) робочих днів з дня такої відмови.
                                </li>
                                <li>
                                    <strong>Dober</strong> докладе комерційно обґрунтованих зусиль для задоволення Користувацьких запитів на видалення, однак певна інформація зберігатиметься в Месенджері. Крім того, права, описані вище, можуть бути обмежені, наприклад, якщо виконання вашого запиту призведе до розкриття Персональних даних іншого Користувача, або якщо ви попросите нас видалити інформацію, яку ми зобов'язані зберігати згідно із законом, або якщо ми маємо законні інтереси в її збереженні, наприклад, з метою запобігання шахрайству або участі в судовому процесі.
                                </li>
                                <li>
                                    Персональні дані можуть залишатися в архівах, а інформація, яку ви оновлюєте або видаляєте, може зберігатися для наших адміністративних цілей тією мірою, якою це дозволено законом. Ми не будемо видаляти інформацію, яку ви розмістили публічно, використовуючи Месенджер або в ньому. Dober не можете видалити всі копії інформації, яка раніше була передана іншим особам.
                                </li>
                                <li>
                                    <strong>Якщо ви є резидентом Каліфорнії</strong>, у вас є додаткові права, з якими ви можете ознайомитись в розділі 11 цієї Політики.
                                </li>
                            </ol>
                        </li>
                        <li>
                            <strong ref={ref_8}>ТЕРМІНИ ЗБЕРІГАННЯ ПЕРСОНАЛЬНИХ ДАНИХ</strong>
                            <ol>
                                <li>
                                    <strong>Dober</strong> зберігає Персональні дані Користувачів до моменту видалення облікового запису Користувача. Якщо ви хочете видалити свій обліковий запис, ви можете зробити це в "налаштуваннях облікового запису". Видалення вашого облікового запису видаляє всі повідомлення, мультимедіа, контакти і всі інші дані, які ви зберігаєте в Dober. Ця дія має бути підтверджена через ваш обліковий запис і не може бути скасована в подальшому. Усі повідомлення та файли, які ви надіслали іншому Користувачеві, залишаться у нього в незмінному вигляді.
                                </li>
                                <li>
                                    При видаленні облікового запису Користувача з Публічного сервера видаляються ключі шифрування, які він використовував для листування, але повідомлення в чатах залишаються. Користувачі, з якими він спілкувався, отримують змінений чат - чат із видаленим акаунтом, у який не можна писати, але можна читати історію листування. Якщо Користувач був власником-створювачем груп, то під час видалення його акаунта такі групи та повідомлення в них видаляються без можливості відновлення. У разі, якщо Користувач власник-створювач груп, перед видаленням свого облікового запису передав права управління групами іншому Користувачеві, такі групи не будуть видалені та повідомлення в них залишаються доступними для читання, обліковий запис видаленого Користувача власника-створювача груп буде відображатися як видалений обліковий запис.
                                </li>
                                <li>
                                    Ми зберігаємо дані виключно в зашифрованому вигляді. Деякі дані можуть зберігатися у нас у такому ж зашифрованому деперсоналізованому вигляді і після того, як ваш обліковий запис буде видалено, але це допустимо виключно для цілей дотримання нами вимог законодавства.
                                </li>
                            </ol>
                        </li>
                        <li>
                            <strong ref={ref_9}>БЕЗПЕКА ЗБЕРІГАННЯ ДАНИХ І DPO</strong>
                            <ol>
                                <li>
                                    Ми впровадили відповідні технічні та організаційні заходи для захисту від несанкціонованого доступу або неправомірної обробки Персональних даних, а також від випадкової втрати, знищення або пошкодження Персональних даних. У межах таких заходів ми намагаємось забезпечити безпеку даних, включаючи фізичну безпеку, безпеку хмарної та мережевої інфраструктури, безпеку третіх осіб, моніторинг безпеки та реагуванням на інциденти. Незважаючи на наші зусилля, жодні заходи безпеки не є досконалими, і жоден метод передачі даних не може бути на 100% гарантовано безпечним і захищеним від будь-якого перехоплення або іншого виду неправомірного використання.
                                </li>
                                <li>Якщо вам стане відомо про   інциденти, що становлять загрозу безпеці ваших даних, зв'яжіться з нами електронною поштою за адресою support@dober.chat.</li>
                                <li>
                                    Централізоване зберігання даних. Дані Користувачів зберігаються на Публічних серверах, що належать або орендовані Dober, які знаходяться в Україні, тобто дані не зберігаються на пристроях Користувача, а втрата пристрою не призводить до втрати інформації. Таким чином, ми не передаємо Персональні дані Користувачів іншим центрам обробки даних. Усі дані зберігаються в зашифрованому вигляді.
                                </li>
                                <li>
                                    Наскрізне шифрування даних. Повідомлення, мультимедіа та файли з чатів, а також вміст дзвінків і дані, які Користувач зберігає у своєму обліковому записі, обробляються тільки на вашому пристрої та на пристрої одержувача (Користувача, з яким ви спілкуєтеся в Месенджері). Перш ніж ці дані потрапляють на наші Публічні сервери, вони шифруються ключем, відомим тільки вам і одержувачу. Публічні сервери Dober оброблятимуть ці наскрізні зашифровані дані, щоб доставити їх одержувачу або зберегти їх. Dober не має способів розшифрувати фактичну інформацію, ми зберігаємо і обробляємо випадкові послідовності символів, які не мають сенсу без ключів, яких немає у Dober.
                                </li>
                                <li>
                                    Посктвантова криптографія - постквантове наскрізне шифрування забезпечує конфіденційність даних Користувачів і є передовою технологією захисту даних. Інформація, яка передається за допомогою Месенджера, доступна тільки відправнику та адресату без можливості її перехоплення або підслуховування.
                                </li>
                                <li>
                                    Для контролю зберігання та безпеки даних Користувачів Dober залучає Data Protection Officer (далі "DPO"), який відповідає за дотримання закону про захист персональних даних, згідно зі статтями 37, 38, 39 GDPR.
                                </li>
                                <li>
                                    Згідно з регламентом GDPR, Dober залучає DPO для виконання таких завдань:
                                    <ol>
                                        <li>
                                            контроль за дотриманням норм і вимог регламенту зі збору та обробки даних;
                                        </li>
                                        <li>
                                            представництво в органах нагляду за дотриманням регламенту;
                                        </li>
                                        <li>
                                            консультування з безпеки даних;
                                        </li>
                                        <li>
                                            розгляду звернень і скарг Користувачів для захисту прав.
                                        </li>
                                        <li>
                                            Dober не несе відповідальності за витік, несанкціонований збір і розкриття, перепродаж і нецільове використання Персональних даних Користувачів, що виникло на Сервері Бізнес акаунта.ернень і скарг Користувачів для захисту прав.
                                        </li>
                                        <li>
                                            Dober не несе відповідальності за витік, несанкціонований збір і розкриття, перепродаж і нецільове використання Персональних даних Користувачів, що виникло на Сервері Бізнес акаунта.ернень і скарг Користувачів для захисту прав.
                                        </li>
                                    </ol>

                                </li>
                            </ol>
                        </li>
                        <li>
                            <strong ref={ref_10}>МІЖНАРОДНА ПЕРЕДАЧА ПЕРСОНАЛЬНИХ ДАНИХ</strong>
                            <ol>
                                <li>
                                    Dober зберігає дані Користувачів на своєму Публічному сервері, розташованому на території України і не здійснює передачу даних за її межі.
                                </li>
                                <li>
                                    У разі, якщо Користувач Бізнес акаунта використовує свій Сервер Бізнес акаунта для збору, зберігання, обробки даних, дані таких Користувачів можуть бути передані за межі країни, в якій проживає Користувач, в тому числі в країни ЄС, за межі ЄС, в США, а також в будь-яку країну, де фізично розташований Сервер Бізнес акаунта. У такому випадку, власник Сервера Бізнес акаунта, Бізнес-клієнт зобов'язується забезпечити дотримання вимог чинного законодавства у відповідній юрисдикції для забезпечення безпеки і збереження даних Користувачів, яким надано доступ до Бізнес акаунту.
                                </li>
                                <li>
                                    Dober не несе відповідальності і не здійснює контроль над передачею даних Користувачів, які отримали доступ і використовують Месенджер через Бізнес акаунт. У разі виникнення запитань, пов'язаних із Персональними даними, Користувачам, які отримали доступ до Бізнес акаунту Месенджера, необхідно звертатися до створювача такого Бізнес акаунту.
                                </li>
                            </ol>
                        </li>
                        <li>
                            <strong ref={ref_11}>ДОДАТКОВЕ ПОВІДОМЛЕННЯ ПРО КОНФІДЕНЦІЙНІСТЬ ДЛЯ ЖИТЕЛІВ КАЛІФОРНІЇ</strong>
                            <ol>
                                <li>
                                Це додаткове повідомлення про конфіденційність для жителів Каліфорнії застосовується виключно до жителів Каліфорнії.
                                </li>
                                <li>
                                CCPA вимагає, щоб ми розкривали інформацію про категорії Персональних даних, які ми збираємо про споживачів у Каліфорнії, категорії джерел, з яких було зібрано інформацію, ділові або комерційні цілі, для яких було зібрано інформацію, а також категорії сторін, яким ми передаємо Персональні дані жителів Каліфорнії.
                                </li>
                                <li>
                                    Якщо Користувач є резидентом Каліфорнії, існують такі права, які йому доступні відповідно до Закону штату Каліфорнія про конфіденційність споживачів ("CCPA"): <br/>
                                    <strong>Право знати</strong>. Ви можете здійснити запит не більше двох разів протягом 12 місяців про наступну інформацію про Персональні дані, які ми зібрали, використали та розкрили про вас за останні 12 місяців:
                                    <ul>
                                        <li>
                                            категорії та конкретні обсяги Персональних даних, які ми зібрали про вас;
                                        </li>
                                        <li>
                                            категорії джерел, з яких ми збирали Персональні дані;
                                        </li>
                                        <li>
                                            цілі, для яких ми збираємо Персональні дані;
                                        </li>
                                        <li>
                                            категорії третіх осіб, яким ми передали Персональні дані;
                                        </li>
                                    </ul>
                                    <br />
                                    Право на видалення. Ви можете вимагати, щоб ми видалили Персональні дані, які ми отримали від вас, з урахуванням певних обмежень відповідно до CCPA. <br />
                                    Право відмовитися від продажу Персональних даних. Ви маєте право відмовитися або заперечувати від продажу ваших Персональних даних. Але, будь ласка, знайте, що ми не продаємо ваші Персональні дані. <br />
                                    Недискримінація. CCPA передбачає, що ви не можете зазнавати дискримінації за здійснення цих прав.
                                </li>
                            </ol>
                        </li>
                        <li>
                            <strong ref={ref_12}>РОЗСИЛКА ТА РЕКЛАМНІ ПРОПОЗИЦІЇ</strong>
                            <ol>
                                <li>Dober не використовує Персональні дані Користувачів для таргетингу реклами або інших комерційних цілей. Dober не передає Персональні дані Користувачів стороннім рекламодавцям з метою націлювання рекламних оголошень на веб-сайтах, в додатках і сервісах. Dober зберігає тільки ту інформацію, яка необхідна для роботи в якості безпечного і багатофункціонального хмарного сервісу.</li>
                                <li>Dober не пропонує Користувачам інструменти для просування своїх повідомлень у групових чатах. Жодні Персональні дані Користувачів не використовуються і не аналізуються для показу реклами або спонсорованих повідомлень.</li>
                            </ol>
                        </li>
                        <li>
                            <strong ref={ref_13}>ПОСИЛАННЯ НА ІНШІ САЙТИ</strong>
                            <ol>
                                <li>
                                    Месенджер не містить посилань на зовнішні ресурси та не інтегрується з ними за API.
                                </li>
                                <li>
                                    Dober не контролює зовнішні ресурси, посилання на які Користувачі можуть надсилати один одному. У разі вашого переходу за посиланням на зовнішні ресурси, ви будете перенаправлені на веб-сайт, в мобільний додаток або на інший ресурс, який може збирати і обробляти ваші Персональні дані. Зовнішні ресурси можуть розміщувати свої власні файли Cookie або інші файли на вашому пристрої, збирати дані або запитувати у вас особисту інформацію. Ми рекомендуємо вам ознайомитися з політиками конфіденційності зовнішніх ресурсів, які ви відвідуєте, переходячи за посиланнями, що надсилають один одному Користувачі. При переході за посиланням на ресурс третьої особи (веб-сайт, додаток тощо), ви залишаєте Dober, правила нашої Політики конфіденційності перестають поширюватися на вас. Dober не контролює вміст сторонніх ресурсів, не дає для них свого схвалення, як і не можемо гарантувати безпеку і збереження ваших даних ними.
                                </li>
                            </ol>
                        </li>
                        <li>
                            <strong ref={ref_14}>ПОСИЛАННЯ НА ІНШІ САЙТИ</strong>
                            <ol>
                                <li>
                                    Dober використовує тільки основні файли Cookie, які призначені для роботи і надання наших послуг в Інтернеті. Файли Cookie, які ми використовуємо, являють собою невеликі текстові файли, які дозволяють Dober надавати, налаштовувати і покращувати взаємодії Користувачів з Dober. Ви можете контролювати файли Cookie через налаштування свого пристрою, в тому числі приймати або не приймати їх, або видалити їх повністю. Ви можете заблокувати файли Cookie у своєму веб-браузері, однак, зверніть увагу, що якщо ви вимкнете файли Cookie, ви не зможете увійти в веб-версію Dober. Ми не використовуємо файли Cookie для профілювання або реклами.
                                </li>
                            </ol>
                        </li>
                        <li>
                            <strong ref={ref_15}>ЗВОРОТНІЙ ЗВ'ЯЗОК</strong>
                            <ol>
                                <li>
                                    З будь-яких питань, що стосуються збору та обробки ваших Персональних даних, ви можете зв'язатися з DPO Dober за адресою електронної пошти: support@dober.chat. DPO Dober надасть відповідь протягом 10 (десяти) днів.
                                </li>
                                <li>
                                    Ви також маєте право отримати додаткову інформацію щодо своїх прав стосовно ваших Персональних даних, надіславши електронного листа на адресу: support@dober.chat. Dober надасть відповідь протягом 10 (десяти) днів.
                                </li>
                                <li>
                                    Якщо у вас є невирішена проблема з конфіденційністю або використанням даних, яку ми не задовольнили, будь-які питання або скарги щодо Dober або цієї Політики, ви можете зв'язатися з нами, надіславши електронного листа на адресу: support@dober.chat. Dober надасть відповідь протягом 10 (десяти) днів. Якщо ваш запит, на наш погляд, вимагає більш тривалого часу для розгляду, ми повідомимо вам про це і приблизні терміни відповіді.
                                </li>
                            </ol>
                        </li>
                        <li>
                            <strong ref={ref_16}>ЗМІНИ В ЦІЙ ПОЛІТИЦІ</strong>
                            <ol>
                                <li>
                                    Dober має право періодично вносити зміни, оновлювати і доповнювати Політику для забезпечення збереження Персональних даних, повідомлення про зміни у використанні Персональних даних і відповідності вимогам законодавства GDPR/CCPA.
                                </li>
                                <li>
                                    У разі суттєвих змін, які стосуються Персональних даних, ми повідомимо Користувачів про подібні зміни шляхом розміщення новин у Месенджері. Рекомендуємо вам періодично переглядати Політику, щоб отримувати інформацію про те, як ми використовуємо ваші Персональні дані.
                                </li>
                                <li>
                                    Після внесення змін до Політики, ми маємо право запитати повторну згоду Користувачів з оновленою Політикою. Зміни до поточної Політики набувають чинності з моменту публікації зміненої версії Політики.
                                </li>
                                <li>
                                    Наші електронні екземпляри Політики конфіденційності, що зберігаються в інший спосіб, вважаються справжніми, повними, дійсними та такими, що підлягають виконанню, версіями цієї Політики, чинної в момент вашої взаємодії з Dober.
                                </li>
                                <li>
                                    Продовжуючи взаємодіяти з Dober, після внесення змін до Політики, ви підтверджуєте свою згоду зі змінами, внесеними до Політики конфіденційності.
                                </li>
                                <li>
                                    Цю Політику конфіденційності було прийнято та опубліковано 20 лютого 2023 року.
                                </li>
                            </ol>
                        </li>
                    </ol>
                </div>
            </div>
        </section>
    )
}